[{"id":"bf52b1fb-bed1-4c44-b78b-0b399f01157f","owner_id":"10a95418-dc69-48a8-a1a4-e9d3c786b093","parent_id":null,"slug":"3-apis-gratuitas-legais-e-excelentes-para-iniciar-os-estudos-na-area","title":"3 APIs gratuitas, legais e excelentes para iniciar os estudos na área!","body":"Eu trabalho com APIs diariamente, já criei algumas, e também já usei de outras pessoas. É inegável o poder e a facilidade que uma API gera para o seu projeto.\nResolvi trazer 3 APIs relativamente simples, mas que podem ajudar a criar projetos criativos!\n\n#### Sobre mim\n[Meu portfolio](https://josevictormoreno.github.io/)\n[Meu GitHub](https://github.com/josevictormoreno)\n\n## 1 - Advice Slip JSON API\nEssa api retorna simplemente um conselho!\n\nExemplo de uso: GET https://api.adviceslip.com/advice\n\nVocê também pode adicionar /search após o advice para fazer buscas\n\n## 2 - API da NASA\nEssa foi uma das que mais me chamou atenção. Com está api voce pode receber várias informações da NASA, é necessário criar uma conta para receber sua chave. Um dos requests que considero mais interessante é o de imagem. Eu desenvolvi um simples site que mostra uma imagem por dia utilizando essa api, o resultado é muito legal. Para quem quiser conhecer, só [clicar aqui](https://josevictormoreno.github.io/projeto-universo/universe/today).\n\n## 3 - API do New York Times\nTambém tenho um projeto que adicionei em meu portfólio com essa api, caso tenha interesse só [clicar aqui](https://josevictormoreno.github.io/znews/home). Com essa api você recebe as noticias mais vistas do NYT. Também é possivel receber os best sellers de livros da amazon. É possível ver um exemplo dos dois (notícias e livros) em meu projeto com este [link](https://josevictormoreno.github.io/znews/home).\n\n### Links\n[Advice Slip JSON API](https://api.adviceslip.com/#endpoint-random)\n[API da NASA](https://api.nasa.gov/)\n[API do New York Times](https://developer.nytimes.com/)","status":"published","source_url":null,"created_at":"2022-12-19T15:42:18.312Z","updated_at":"2022-12-19T15:42:18.312Z","published_at":"2022-12-19T15:42:18.312Z","deleted_at":null,"owner_username":"josevictormoreno","tabcoins":23,"children_deep_count":8},{"id":"db04069f-c7b4-414d-8c52-97c1669a7171","owner_id":"74346400-b526-4e32-bcb9-71433b01e0a4","parent_id":null,"slug":"ecossistema-brasileiro-de-micro-saas","title":"Pitch: Ecossistema brasileiro de Micro-SaaS","body":"Fala galera \n\nTudo bem? Sou o Bruno Okamoto, escritor da newsletter **A nova economia do Micro-SaaS**.\n\nNa minha news, já publiquei +40 artigos sobre Micro-SaaS\n-Sendo **18 sobre como construir um portfólio** de pequenas apostas.\n-**9 estudos de caso** de empreendedores hardcode/nocode de MicroSaaS\n-**4 artigo sobre como construir negócios calmos** e cuidar de si durante a jornada\n-além de alguns estudos sobre Micro Private Equity, listas de ideias e marketplaces para você buscar oportunidades.\n\nPara quem não sabe o que é um Micro-SaaS, você pode ver meu primeiro vídeo que lancei na semana passada no YouTube. Primeiro canal brasileiro sobre Micro-SaaS: https://youtu.be/YjjoqLTuVpI\n\n**Micro-SaaS é o melhor investimento do mundo**, principalmente para quem sabe construir produtos. \n\n**Conheça o projeto: microsaas.com.br** e participe da **[comunidade no Telegram](https://t.me/microsaasbr)**","status":"published","source_url":"https://microsaas.com.br","created_at":"2022-12-18T18:50:47.430Z","updated_at":"2022-12-18T20:09:23.318Z","published_at":"2022-12-18T18:50:47.455Z","deleted_at":null,"owner_username":"bokamoto","tabcoins":13,"children_deep_count":9},{"id":"aa3cf921-f68e-44c1-ad41-9ee6a79d5d38","owner_id":"37953850-6dff-4b87-b35f-fb4ef56d5876","parent_id":null,"slug":"auroralogo-uma-linguagem-de-programacao-didatica","title":"Pitch: AuroraLogo, uma linguagem de programação didática.","body":"Olá! Sou novo aqui no TabNews. Meu nome é David Buzatto e sou professor atualmente lotado no câmpus São João da Boa Vista do Instituto Federal de Educação, Ciência e Tecnologia de São Paulo. Há alguns meses desenvolvi uma linguagem de programação de cunho didático e estou postando esse novo conteúdo para que a conheçam.\n\nSegue abaixo a apresentação da mesma, os links para download e para um tutorial que gravei no meu canal do YouTube, onde eu também documentei quase todo o processo de desenvolvimento.\n\nDentro do próprio ambiente há uma série de exemplos para que o pontapé inicial possa ser dado por quem já conhece algo sobre programação.\n\nCríticas e sugestões são super bem-vindas!\n\n---\nA linguagem de programação AuroraLogo é desenvolvida e mantida pelo Prof. Dr. David Buzatto do Instituto Federal de Educação, Ciência e Tecnologia de São Paulo.\nO objetivo a mesma é ser usada como uma linguagem de programação didática no apoio ao ensino de programação de computadores, permitindo que os alunos usem construções próximas à linguagem natural para fornecer comandos à uma tartaruga.\nEssa linguagem tem como fonte de inspiração a linguagem Logo e foi nomeada assim em homenagem à Aurora Buzatto, filha do autor da linguagem, pois a motivação inicial foi o desenvolvimento de um ambiente de programação para ensinar a Aurora a programar futuramente.\n\nPágina do projeto: https://github.com/davidbuzatto/AuroraLogo\n\nTutorial de apresentação: https://www.youtube.com/watch?v=_72eHn1f3og\n\nCanal no YouTube: https://www.youtube.com/channel/UCtuPFOgX47mBfNoG4gXgjfA","status":"published","source_url":null,"created_at":"2022-12-19T16:59:34.239Z","updated_at":"2022-12-19T17:08:55.762Z","published_at":"2022-12-19T16:59:34.248Z","deleted_at":null,"owner_username":"davidbuzatto","tabcoins":4,"children_deep_count":2},{"id":"f867c826-69d7-4f21-a65f-99b21f7fe692","owner_id":"f79f2b1b-9927-4c43-ad29-a2cd4e9e9972","parent_id":null,"slug":"como-jr-peco-nao-seja-o-tipo-de-sr-que-vou-descrever-abaixo-por-favor","title":"Como Jr. peço: Não seja o tipo de Sr que vou descrever abaixo, por favor","body":"Sou dev Jr. jr. (um estagiário Sr., rs) e recentemente passei pela situação no seguinte contexto:\n\nEstava desenvolvendo uma tarefa e um colega disse que resolveria outra relacionada a minha. Prontamente pedi que ele (dev Sr.) deixasse essa outra tarefa pra mim porque ela estava diretamente relacionada com a que eu estava desenvolvendo e ele concordou. Afinal, havia tarefas BEM mais complexas que eu, se as pegasse, levaria mais tempo pra resolver além de, MUITO provavelmente, ocupar outro colega pedindo explicações e direcionamentos.\n\nTerminei minha tarefa e percebi que a tal outra tarefa já havia sido resolvida por Outro dev Sr. da equipe que não era o colega que citei primeiro. Acontece que esse Outro dev Sr., que \"resolveu\" a tarefa, tem costume de pegar tarefas pra encher o board com seu avatar e dizer depois que ele é quem resolve mais tarefas (ele já disse isso pra mim), não importando se são tarefas simples. Obviamente ele resolve, de fato, várias corretamente. Mas esse não foi um caso pontual. Demonstro adiante.\n\nAcontece que ao terminar a minha tarefa e mesclar minha branch local com a que continha o trabalho dos outros colegas percebi que a tal outra tarefa, resolvida pelo Outro dev Sr., estava errada. Sim, foi implementada com erro (e não venha tentar desmerecer essa minha colocação baseado na minha senioridade frente a desse colega).\nObviamente corrigi e segui adiante, mas avisei um terceiro colega (Sr. também) para que coferisse o que o Outro dev Sr. fez na branch que ele tava trabalhando junto pois, por conta dessa sanha de \"resolver mais\", provavelmente teria erros e isso se confirmou quando esse terceiro colega me disse que ao mesclar as branches várias partes do código \"quebraram\", mesmo não mostrando conflitos.\n\n\"Mas então você está dizendo que Sr. não tem de pegar tarefas simples quando tem Jr. na equipe????\"\n\nDE FORMA ALGUMA!\n\nO que gostaria de pedir aos Sr. (só aos que vestirão a carapuça) é que não fiquem na sanha de resolver todas as tarefas do board sem se preocupar se estão, de fato, resolvidas como o esperado.\n\nE se há tarefas mais complexas que outras, tendo um Jr. na equipe, o que custa deixar as menos complexas pro final para que o Jr. tenha mais coisas a resolver e, com isso, se desenvolver? ;-)","status":"published","source_url":null,"created_at":"2022-12-19T15:44:09.988Z","updated_at":"2022-12-19T15:44:09.988Z","published_at":"2022-12-19T15:44:10.018Z","deleted_at":null,"owner_username":"JCarvalho","tabcoins":2,"children_deep_count":4},{"id":"cfdc9ba2-994b-4202-af91-cc0a4f0fec68","owner_id":"61f263be-0593-4bd3-9175-ac759141d579","parent_id":null,"slug":"business-growth-nao-e-marketing","title":"[Business] - Growth NÃO é marketing.","body":"## O que é e o que não é Growth.\n\nGrowth tem a ver com a capacidade de uma empresa subir de patamar, desenvolvendo-se de modo contínuo e exponencial, com o menor custo e tempo possíveis.\n\nGrowth não foca em atração e aquisição de clientes, mas sim no impulsionamento da empresa e dos clientes já adquiridos.\n\n### Para pensar:\n\n- A sua empresa tem alguém ou um time responsável por analisar e identificar possibilidades de melhorias?\n- As decisões são orientada por dados ou por emoções?\n- A sua empresa ou seu time é estratégico ou só “apaga incêndios”?\n\n## 4 Pilares do Growth:\n\n1. Modelo: Forma de negócio usada para vender.\n2. Canal: Cada uma das avenidas de distribuição do produto.\n3. Produto: Solução entregável.\n4. Mercado: Público alvo.\n\n### Esses pilares se relacionam e operam de maneira intregada, como:\n\n- Fit de Produto e Mercado (Product Maket Fit)\n- Fit de Modelo e Canal\n- Fit de Mercado e Canal\n- Fit de Canal e Produto\n\n### Fit de Produto e Mercado - Product Market Fit (PMF)\n\nUsado para definir um produto que atende a demanda do mercado, ou seja, é a solução de um desejo ou uma dor existente no mercado. Deve ser a primeira preocupação da empresa com seu produto, pois irá comprovar se as entregas estão sendo consumidas ou não.\n\n### Fit de Modelo e Mercado:\n\nUsado para conhecer o mercado ao qual se pretende atender, para que com isso seja possível garantir a viabilidade do negócio. Cada mercado com seu perfil e particularidades influência um tipo de modelo diferente.\n\n> **Por isso é importante entender a fundo o mercado.**\n> \n\n### Fit de Modelo e Canal:\n\nCada modelo de negócio é único e possui uma complexidade impar, com custos e capacidade de geração de valor variados. Isso faz ser necessário ter canais de distribuição que sejam compatíveis com o modelo para manter um bom Unit Economics.\n\n> **Analisando se o custo é alto ou não se está adequado ou não.**\n> \n\n### Fit de Canal e Produto:\n\nComo cada produto atende uma dor específica, logo seu caminho até que essa dor seja sanada também é específico, sendo assim, o fit de canal e produto visa buscar o canal de distribuição ideal para que o produto chegue nas mão de quem precisa da maneira mais eficiente.\n\n## O bom profissional de Growth:\n\n### Dominar 3 características:\n\n1. Capacidade Analítica.\n2. Visão de Negócios.\n3. Facilidade com Dados.\n\nSkills como Escuta ativa, Empatia e Transparência são essênciais. \n\nCriativo: gerar soluções simples (rápidas, práticas e de baixo custo) a partir do que analisa.\n\n# GROWTH HACKING NÃO É MÁGICA, MAS SIM CICLOS DE TESTES E PESQUISA, OU SEJA, É MÃO NA MASSA - OU NOS DADOS.\n\n[Support me](https://www.buymeacoffee.com/nathanpacheco)","status":"published","source_url":"https://www.linkedin.com/in/nathan-pacheco-744543165/","created_at":"2022-12-19T17:45:30.200Z","updated_at":"2022-12-19T17:45:30.200Z","published_at":"2022-12-19T17:45:30.214Z","deleted_at":null,"owner_username":"NathanPacheco","tabcoins":6,"children_deep_count":0},{"id":"dd46c34b-8204-45d2-9544-16ce02c6b9cd","owner_id":"98d29878-c445-425c-8f37-e278f69e1f8a","parent_id":null,"slug":"eu-gostaria-de-saber-qual-a-melhor-forma-de-fazer-a-validacao-de-um-login","title":"Eu gostaria de saber qual a melhor forma de fazer a validação de um login?","body":"Eu estou usando como linguagem o Javascript e como pacote o jsonWebToken para criar um token ao fazer o login. Mas minha dúvida seria para que quando o usuario fechar o site e voltar, continuar logado até que o token expire, eu poderia usar express session, algo relacionado a cookies ou cache?","status":"published","source_url":null,"created_at":"2022-12-19T16:51:05.416Z","updated_at":"2022-12-19T16:51:34.178Z","published_at":"2022-12-19T16:51:05.423Z","deleted_at":null,"owner_username":"PzK167","tabcoins":1,"children_deep_count":6},{"id":"c1f97dda-cf5f-44a2-a817-a3212de5298a","owner_id":"2bfbc343-f4e5-42c6-8430-26251884d667","parent_id":null,"slug":"1-convite-professor-de-programacao-eu-exatamanete","title":"[1° CONVITE] Professor de programação, Eu?!  - Exatamanete","body":"Estou procurando por desenvolvedores experientes para se tornarem mentores em uma plataforma de streaming de programação <3\n\nEstamos lançando um produto que \n- conecta iniciantes e profissionais em salas ao vivo que podem ou não ser transmitidas \n- e permite a demonstração individual de conhecimento em formato de live.\n\nEstamos na versão 1 e o produto nunca foi divulgado, mas já estamos buscando por mentores para ajudar a testar e sugerir melhorias.\n\nNo momento, não existe nenhuma funcionalidade que gere renda para o produto ou para os mentores, mas já temos funcionalidades planejadas para esse propósito.\n\n**Se você é um desenvolvedor experiente e está interessado em se tornar um mentor nesta plataforma, preencha o formulário aqui.** *Ou simplesmente nos ajude a gerar insigths ;D*\n\n\n[FORMULÁRIO](https://forms.gle/eh2TYLisHK4tjZNA9)\n\n[Após refinar o produto, faço um segundo convite o apresentando de fato]","status":"published","source_url":null,"created_at":"2022-12-19T16:30:41.388Z","updated_at":"2022-12-19T16:30:41.388Z","published_at":"2022-12-19T16:30:41.406Z","deleted_at":null,"owner_username":"EduardoWorrel","tabcoins":1,"children_deep_count":0},{"id":"860b5abf-a189-4e15-a692-8274665b8296","owner_id":"5c4c025d-0c44-4ba3-80aa-e543f46119e4","parent_id":null,"slug":"razoes-para-considerar-rust-e-se-integrar-a-sua-comunidade","title":"🦀 Razões para considerar Rust e se integrar à comunidade","body":"Esperamos que este pequeno artigo esclareça nossas motivações em estabelecer o [Servidor Rust Lusófono](https://discord.gg/Ma5nNmc6Mn) como uma referência útil àqueles que trabalham, estudam ou apenas se interessam pela linguagem. Tivemos em vista oferecer também os mesmos motivos para que você considere utilizar Rust e se beneficiar do crescimento da nossa comunidade.\n\nA linguagem de programação Rust ganhou popularidade significativa nos últimos anos devido à sua forte ênfase em segurança, simultaneidade e eficiência. Essas características o tornam adequado para uma variedade de aplicações, incluindo desenvolvimento web, desenvolvimento de jogos e programação de sistemas.\n\nHoje um programador Rust recebe salários mais altos que a média de programadores em outras linguagens, mas o que pavimentou esse interesse crescente em Rust em todo o mundo?\n\n\nUm fator que contribuiu para a popularidade do Rust é seu foco na segurança. A linguagem foi projetada para evitar erros de programação comuns, como referências de ponteiro nulas ou oscilantes, que podem levar a vulnerabilidades de segurança ou travamentos. Isso o torna uma boa escolha para o desenvolvimento de sistemas críticos onde a confiabilidade e a segurança são importantes.\n\nOutra razão para o crescimento de Rust é seu suporte à simultaneidade, que se refere à capacidade de um programa executar várias tarefas simultaneamente. O design do Rust facilita escrever código simultâneo seguro e eficiente, o que é importante para a construção de sistemas de alto desempenho.\n\nAlém de seu foco em segurança e simultaneidade, Rust também é conhecido por sua eficiência. É uma linguagem de tipagem estática, o que significa que executa a verificação de tipo em tempo de compilação em vez de tempo de execução. Isso pode resultar em um código mais rápido e eficiente. Rust também possui um controle de baixo nível sobre os recursos do sistema, o que lhe permite obter desempenho equivalente a linguagens como C e C++.\n\nA popularidade do Rust foi impulsionada ainda mais por seu crescente ecossistema de bibliotecas e ferramentas. A comunidade Rust desenvolveu um grande número de bibliotecas e ferramentas que facilitam a criação e implantação de aplicativos Rust. Isso o tornou mais acessível para desenvolvedores que desejam usar o Rust em seus projetos.\n\n\nNo geral, a combinação do foco do Rust em segurança, simultaneidade e eficiência, com o crescimento de seu ecossistema, contribuiu para sua popularização entre os desenvolvedores. Tornou-se uma escolha popular para a construção de software de sistemas confiáveis e de alto desempenho.\n\nO mercado de Rust já é uma realidade em muitos países ao norte do mundo e agora é a vez daqueles que estão ao hemisfério sul abraçar as oportunidades desse novo ecossistema na produção de suas tecnologias.\n\n# Por que enfatizamos a importância de uma comunidade?\n\nAs comunidades são uma parte vital do ecossistema de desenvolvimento de software. Elas reúnem desenvolvedores, usuários e outras partes interessadas para colaborar, compartilhar conhecimento e apoio mútuo na construção e uso de software.\n\n![caranguejo mascote do Rust: o Ferris](https://www.oreilly.com/api/v2/epubs/9781492067665/files/images/f0524-01.jpg)\n\nUm dos principais benefícios das comunidades é sua capacidade de promover a colaboração e o compartilhamento de conhecimento. Em uma comunidade, os desenvolvedores podem pedir ajuda com desafios técnicos, compartilhar seus próprios conhecimentos com outras pessoas e aprender com as experiências de seus colegas. Esse ambiente colaborativo ajuda os desenvolvedores a se manterem atualizados sobre as tecnologias e práticas recomendadas mais recentes e a melhorar suas habilidades e a produtividade.\n\nOutro benefício importante das comunidades é sua capacidade de fornecer suporte aos usuários do software. Em muitos casos, os usuários podem ter dúvidas ou encontrar problemas ao usar o software. Uma forte comunidade de software pode fornecer um fórum para que os usuários façam perguntas, obtenham ajuda e compartilhem suas experiências com outras pessoas. Isso não apenas ajuda os usuários a obter o máximo do software, mas também ajuda a melhorar o próprio software, identificando e abordando quaisquer problemas ou pontos fracos.\n\nAs comunidades também podem ser uma fonte de inovação e criatividade. Ao reunir um grupo diversificado de pessoas com diferentes formações e perspectivas, as comunidades podem gerar novas ideias e abordagens para resolver problemas. Isso pode levar ao desenvolvimento de novos recursos e capacidades para o software, bem como novos aplicativos e usos para ele.\n\nAlém desses benefícios, as comunidades também podem ajudar a construir um senso de comunidade e pertencimento entre seus membros. Ao participar de uma comunidade, desenvolvedores e usuários podem se sentir conectados a outras pessoas que compartilham seus interesses e objetivos e podem construir relacionamentos significativos com seus pares.\n\nNo geral, as comunidades de software desempenham um papel crucial no desenvolvimento e uso de software. Eles promovem colaboração, compartilhamento de conhecimento, suporte, inovação e construção de comunidade, todos essenciais para o crescimento contínuo e o sucesso da indústria de software.\n\n# A necessidade que visamos atender com a criação do Servidor Rust Lusófono.\n\nA linguagem de programação Rust é uma escolha popular para o desenvolvimento de software de sistemas confiáveis e de alto desempenho em diversos países. Sendo usado em vários setores, incluindo desenvolvimento da Web, desenvolvimento de jogos e programação de sistemas. Muito impulsionado pelos altos salários praticados nesta linguagem, muitas oportunidades de trabalho e aprendizado para os falantes de língua inglesa. Contudo, Rust começa gradualmente ser empregado nos países lusófonos (principalmente Brasil e Portugal) sem que haja um espaço acolhedor aos iniciantes em programação e sobre tudo os que não são fluentes em inglês. \n\nDada a popularidade e utilidade de Rust, é importante que haja recursos e suporte disponíveis para quem deseja aprender. Uma maneira eficaz que encontramos de atender essa demanda foi por meio da criação do Servidor Rust Lusófono no Discord, uma plataforma de comunicação popular para comunidades online.\n\nExistem várias razões pelas quais um servidor de aprendizado Rust no Discord seria benéfico. Primeiro, forneceria um local centralizado para os interessados fazerem perguntas, compartilharem recursos e receberem suporte de desenvolvedores Rust mais experientes. Isso ajudaria a criar um ambiente de aprendizagem solidário e colaborativo, onde os iniciantes podem aprender uns com os outros e com os membros mais experientes da comunidade.\n\nEm segundo lugar, um [servidor de aprendizado Rust no Discord](https://discord.gg/Ma5nNmc6Mn) pode oferecer uma variedade de recursos e atividades para ajudar os novatos a melhorar suas habilidades e conhecimentos. Isso pode incluir coisas como desafios de código, sessões de tutorial e apresentações de projetos. Ao participar dessas atividades, os iniciantes podem ganhar experiência prática e desenvolver suas habilidades em um ambiente de suporte e interativo.\n\nPor fim, o [Servidor Rust Lusófono](https://discord.gg/Ma5nNmc6Mn) fornecerá um senso de comunidade e pertencimento aos aprendizes, experientes e interessados na linguagem. Ao ingressar no servidor, os alunos podem se conectar com outras pessoas que compartilham seu interesse em Rust e podem construir relacionamentos com seus colegas. Esse senso de comunidade pode ser especialmente importante para os iniciantes que podem não ter acesso a recursos ou suporte presenciais, sobre tudo em língua portuguesa.\n\nEm resumo, a criação do [Servidor Rust Lusófono](https://discord.gg/Ma5nNmc6Mn) de aprendizado em Rust no Discord seria um recurso valioso para quem deseja aprender a linguagem Rust comodamente em português. Ele forneceria um ambiente de aprendizado colaborativo e de apoio, uma variedade de recursos e atividades e um senso de comunidade para os cada vez mais numerosos adeptos de Rust.\n\nlink para o servidor: https://discord.gg/Ma5nNmc6Mn","status":"published","source_url":null,"created_at":"2022-12-17T21:22:36.070Z","updated_at":"2022-12-17T21:36:18.563Z","published_at":"2022-12-17T21:22:36.098Z","deleted_at":null,"owner_username":"igotfr","tabcoins":51,"children_deep_count":10},{"id":"6f682c0f-35da-4245-9378-1483e99b2b15","owner_id":"8fde4121-2f75-4240-bbbe-d92eea20ac4f","parent_id":null,"slug":"meu-site-de-vagas-uma-parte-de-inspiracao-vinda-do-tabnews-1","title":"Pitch: Meu Site de Vagas ( uma parte de Inspiração vinda do TabNews ⌨️) - 1","body":"<a href='https://seek-jobs.netlify.app/jobs'>https://seek-jobs.netlify.app/jobs </a>\n\n<h2> ⌨️Site para Compartilhamento de Vagas </h2>\n<code>O TabsNews foi uma das inspirações para eu decidir criar o meu site de vagas Tech </code>\n<br>\n<a href='https://seek-jobs.netlify.app/jobs'>https://seek-jobs.netlify.app/jobs </a>\n<h5>Open Source</h5>\n<a href='https://t.me/+LS-vQvo-8o1iZjEx'/> Link Telegram </a>\n\n<h4>Olá Devs! Construi este site (em andamento) para a divulgação de vagas gratuitamentenas diversas mídias sociais.</h3>\n\n<p>Ainda está em desenvolvimento (NavBar não funcionando ainda), tenho muitas features e funcionalidades pra acrescentar mas gostaria apenas de compartilhar com vocês o que já tenho pronto. Em breve com as melhorias vou postando aqui na TabNews.</p>\n<br>\n<h3>✨Tecnologias e Recursor Uitlizados </h3>\n<b>Library</b>\n<li>React</li>\n<br>\n\n<b> Para criação de Components estilizados </b>\n<li>Material UI (MUI) </li>\n<br>\n<b> Para Navegação </b>\n<li> React-Router-Dom </li>\n<br>\n<b> Para Conexão com APIRest </b>\n<li> Axios </li>\n<br>\n<b> Para gerenciamento de Estados </b>\n<li> Mobx </li>\n<br>\n<b> Para criação da API </b>\n<li> Node.JS </li>\n<li>Express </li>\n<li>Mongoose </li>\n<br>\n<b> Hospedagem da API (Gratuita, ainda) </b>\n<li> Render.com </li>\n<br>\n<b> Banco de Dados </b>\n<li> MongoDB </li>\n<br>\n<b> Hospedagem de Domínio do Website </b>\n<li> Netlify </li>\n\n\n<h2> Quanto me custou fazer essa aplicação ? </h2>\n💵💵💵💵💵💵💵\n<p> Até então </p> <h4>R$0,00 !</h4>\n💵💵💵💵💵💵💵\n<p> Mais custou 2 dias de trabalho, muita inspiração, direção (Divina🙌), e pesquisar no Google 😂 </p>\n <br>\n    <p>Pretendo expandir a aplicação e sei que pra isso precisarei colocar uma hospedagem paga além de aprimorar o meu plano do MongoDB </p>\n    \n   🔨Features a acrescentar \n    \n    - Login e Cadastro de Usuários,\n    - Filtro para as Vagas,\n    - Paginação,\n        \n  <br>\n  <br>       \n <h4> Contribuições </h4>\n     Link da Vaquinha: \n<a href='https://www.vakinha.com.br/3344996'> https://www.vakinha.com.br/3344996\n</a>\n<br>Chave Pix da Vaquinha: 3344996@vakinha.com.br\n<br>Link do telegram:\n\nhttps://t.me/+LS-vQvo-8o1iZjEx\n\n\n  <h1> Espero que curtam 😎</h1>","status":"published","source_url":"https://seek-jobs.netlify.app/jobs","created_at":"2022-12-16T20:00:36.216Z","updated_at":"2022-12-16T21:29:16.453Z","published_at":"2022-12-16T20:00:36.237Z","deleted_at":null,"owner_username":"LukasdeSouza","tabcoins":31,"children_deep_count":40},{"id":"a02e9f27-b36d-4a7a-ac16-7a2b3b95bc26","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"74-por-cento-dos-desenvolvedores-estao-ativamente-procurando-ou-abertos-a-um-novo-emprego-mostra-pesquisa-do-stack-overflow","title":"74% dos desenvolvedores estão “ativamente procurando” ou “abertos a” um novo emprego, mostra pesquisa do Stack Overflow","body":"Dentre os 2.600 profissionais da área entrevistados, 54% apontaram salários mais altos como o principal motivador ao considerar novas vagas.\n\nQuanto às desvantagens de suas funções atuais, a maioria citou horários rígidos de expediente (46%) e a exigência de trabalho presencial (44%).","status":"published","source_url":"https://stackoverflow.blog/2022/12/15/job-insights-from-the-tech-community-the-latest-survey-results-from-stack-overflow-knows/","created_at":"2022-12-19T14:10:45.448Z","updated_at":"2022-12-19T14:10:45.448Z","published_at":"2022-12-19T14:10:45.455Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":6,"children_deep_count":1},{"id":"5efdab57-667c-4c11-96f8-63ef054c0c41","owner_id":"c980ff71-c669-419c-be26-15664c15c635","parent_id":null,"slug":"aprenda-html-css-e-javascript-com-esse-projeto-delicinha-de-um-jogo-online-de-adivinhacao","title":"Pitch: 🔢 Aprenda HTML, CSS, e JavaScript com esse projeto delicinha de um jogo online de adivinhação 🪄","body":"##\n### 🔢 \"Adivinha meu número\" 🪄\n\nQuando mais novo, ganhei um jogo que basicamente eram 6 pequenos cartões quadrados de madeira, com vários números escritos em cada cartão, conhecido como _“Jogo da Idade”_. Basicamente o jogo consistia em adivinhar o número (de 1 a 63) pensado por alguém, utilizando esses cartões.\n\nO segredo por trás era ao mesmo tempo simples, e **fascinante!** E como eu estava começando a aprender a programar na época em C, decidi tentar replicar aquele jogo num sisteminha em C sendo executado no terminal.\n\nDesde então, sempre que aprendo uma nova linguagem, depois de executar um _“Hello World”_, recriar esse joguinho com a nova linguagem me ajuda a treinar alguns conceitos. Há um tempo já tinha recriado ele apenas com HTML, CSS e JavaScript, e decidi agora compartilhar online.\n\n##\n\n![Imagem dos cartões](https://2.bp.blogspot.com/-vrauSb6SjMI/VGN5dV8XBzI/AAAAAAAAA-k/I4KgBzRw-wA/s1600/cart%C3%B5es.png)\n\n##\n\nVocê pode utilizá-lo para treinar seus conhecimentos em **HTML, CSS e JavaScript**, e aqui vai a explicação para quem quiser entender toda a lógica do seu funcionamento, e vários conceitos bem interessantes por trás do site:\n\nPrimeiramente, como citado, o _“Jogo Online”_ foi construído utilizando apenas **HTML, CSS e JavaScript.** Dessa forma, a gente tem uma implementação de uma aplicação funcionando como uma espécie de _“SPA – Single Page Application”_, sem a utilização de nenhum Framework, ou servidor. Ou seja, o JavaScript controla toda a “dinamicidade” do site, seus elementos HTML e estilização em CSS. **JavaScript está por trás de toda construção e lógica.**\n\n##\n\n- Você pode conferir, brincar com o jogo, e compartilhar com a galera aqui: www.adivinhameunumero.com.br\n\n- Todo código do projeto você confere no meu **GitHub**: www.github.com/marques-gabriel/adivinhameunumero/\n\n##\n\n### E como de fato funciona a “MÁGICA”, e o site adivinha o número?\n\nÉ tudo **matemática.**\n\nDe forma resumida, os cartões são construídos através de uma sequência lógica, e o script recupera o menor número do cartão apresentado onde o usuário respondeu “Sim”. Faz a soma e adivinha o número, por meio das somas de **potências de base 2.** O segredo está nos números apresentados. Confuso, não é?! Aqui vai um vídeo com a explicação mais detalhada desse princípio: [Explicação da adivinhação do número por cartelas](https://www.youtube.com/watch?v=I9yxHpcVRKU)\n\n##\n\n### Sobre o código do jogo:\n\nO site parece adivinhar o número por eliminação, e dá a impressão de apresentar números aleatórios na tela. Isso é apenas um “efeito” para melhorar a mágica no site. Mas observe que o site sempre pergunta apenas 6 vezes para o usuário, apresentando os 6 cartões. Essa aleatoriedade é construída através do algoritmo **Fisher–Yates shuffle**, que faz o embaralhamento de arrays. Você pode conferir como funciona esse algoritmo: [Como embaralhar arrays com o algoritmo Fisher–Yates](http://cangaceirojavascript.com.br/como-embaralhar-arrays-algoritmo-fisher-yates/\n)\n\nAlém disso, os números de cada cartão também são _\"embaralhados\"_, utilizando ``` setTimeout() ``` e  ``` Math.random() ```\n\n##\nO HTML é extremamente simples, e os elementos apresentados são construídos através de JavaScript, que é sempre acionado através do evento ```“onclick”```\n\n##\nPor fim, as **classes** dos elementos ativos também são controladas com o JavaScript e CSS. Ainda não sou tão habilidoso com CSS, mas tentei utilizar um pouco de animação CSS para apresentar algo mais agradável, e utilizar um pouco de responsividade. \n\n##\n\n**Divirtam-se!**","status":"published","source_url":"https://github.com/marques-gabriel/adivinhameunumero/","created_at":"2022-12-19T02:16:41.258Z","updated_at":"2022-12-19T02:52:56.685Z","published_at":"2022-12-19T02:16:41.279Z","deleted_at":null,"owner_username":"gabrielmarques","tabcoins":6,"children_deep_count":6},{"id":"0618c456-8166-4963-9a98-82c2d072903b","owner_id":"ea80bc9e-292e-484b-a298-5af6e453cd22","parent_id":null,"slug":"console-ninja-extensao-vs-code","title":"Console Ninja [Extensão VS Code]","body":"<p align=\"center\">\n  <img src=\"https://wallabyjs.gallerycdn.vsassets.io/extensions/wallabyjs/console-ninja/0.0.46/1671327499835/Microsoft.VisualStudio.Services.Icons.Default\" width=\"150\" />\n</p>\n\n### O que é?\n\nVenho apresentar para vocês uma extensão para o VS Code que estou utilizando muito ultimamente, a [**Console Ninja**](https://marketplace.visualstudio.com/items?itemName=WallabyJs.console-ninja).\n\nCom ela é possível visualizar os `console.log` em tempo de execução direto no código, ou através de um console próprio direto no VS Code.\n\n### Exemplos de uso\n\nGif do desenvolvedor da extensão:\n\n<p align=\"center\">\n  <img src=\"https://console-ninja.com/images/docs-main.gif\" />\n</p>\n\n<p>\n  <img src=\"https://i.ibb.co/Jkbj4W5/Captura-de-tela-2022-12-18-152212.png\" />\n</p>\n\nNo exemplo acima podemos ver que foi clicado 3 vezes no botão `count is {count}`, e o resultado de cada `console.log` é exibido ao lado:\n\n<img src=\"https://i.ibb.co/VLxDKCz/exemplo-clicked.png\" />\n\n\n### Técnologias suportadas\n\n- Vite,\n    -  React\n    -  Vue\n    -  Preact\n    -  Lit\n    -  Svelte\n    -  Vanilla\n    -  TypeScript ou JavaScript\n    -  Nuxt \n    -  SvelteKit\n- Webpack\n    - Create React App\n    - Angular CLI\n    - Angular Nx\n    - Gatsby.js\n- Next.js\n- Jest\n- Cypress.io\n- http-server e servidores HTTP estáticos.\n- Live Server\n- Live Preview \n- Nuxt Vue.js\n- Shopify Hydrogen\n\n### Link\n\n[https://marketplace.visualstudio.com/items?itemName=WallabyJs.console-ninja](https://marketplace.visualstudio.com/items?itemName=WallabyJs.console-ninja)","status":"published","source_url":null,"created_at":"2022-12-18T18:47:14.315Z","updated_at":"2022-12-18T23:26:19.420Z","published_at":"2022-12-18T18:47:14.337Z","deleted_at":null,"owner_username":"rafaelkerni","tabcoins":6,"children_deep_count":6},{"id":"8e343095-ae63-4dba-9109-c37dd2756966","owner_id":"80f0583a-3588-4f8d-b06c-f4c349c98a09","parent_id":null,"slug":"o-processo-e-mais-importante-que-o-resultado","title":"🧙‍♂️ O processo é mais importante que o resultado.","body":"### O resultado é o de menos. Para aprender algo de verdade, o foco deve ser o processo.\n\nSe eu tivesse que dar apenas uma dica para quem está começando, ou até para quem já tem alguma experiência na área de tecnologia, seria essa: **Entenda o processo, e de que forma você chegou ao resultado, como você venceu as barreiras que encontrou. O resultado é o de menos**.\n\nNo começo dos estudos em programação, principalmente na área de Front-End, é comum ficarmos muito entusiasmados, pois geralmente nas primeiras aulas você já coloca a mão na massa, e vê o seu primeiro site ganhar vida e cor, de uma forma muito rápida. Inclusive, acredito que esse é um dos principais motivos do porque as pessoas escolhem o Front-End para iniciar seus estudos, pois o resultado e a sensação de fazer/construir algo vem muito mais rápido, e de forma visual, o que causa uma sensação ótima para seu cérebro, mas isso é assunto para outro post.\n\nÉ normal neste começo você ver as coisas funcionando sem ter muita noção do porque isto funciona, ou então porque minha página está toda branca, ou porque o console do meu navegador está com todos esses erros. Nestes momentos, o que eu fazia, e que acredito que muita gente também, é dar o famoso Ctrl + C na mensagem do erro, e Ctrl + V no Google, com o objetivo de encontrar a resposta pronta em forma de código, fazendo com que a página volte a funcionar. E não há nada errado em se fazer isso, principalmente para quem está começando. O problema começa quando você vira refém, e qualquer problema é corrigido apenas copiando códigos prontos.\n\n### \"Eu consegui fazer, mas parece que falta algo, não sei se entendi.\"\n\nNo início dos meus estudos, eu queria ver o site funcionando, não importa se tem uma função testando 20 *if's*, ou qualquer outra gambiarra copiada da internet, o importante é funcionar. E sempre ao final desses projetos eu tinha a mesma sensação: \n> Consegui. Mas parece que falta algo. Era pra eu estar mega feliz, mas tenho um sentimento de medo ou vergonha que não sei explicar.\n\nEu entendia boa parte do que era ensinado, mas parece que faltava um \"click\" no meu cérebro, pra soltar aquele: **Ahhhhhhh, agora faz sentido, eu realmente entendi o porque disso.**\n\nE foi então que eu assisti um vídeo de um garoto que descobriu um bug em um site de uma empresa famosa (acho que era um bug no site do Instagram), e fizeram uma entrevista com ele. E as perguntas eram todas sobre o resultado em si, qual a reação quando ele descobriu o dinheiro que ganhou, como os pais dele reagiram, qual foi a sensação quando ele finalmente descobriu o bug. E ai o garoto disse algo que mudou meu ponto de vista:\n> É tudo muito legal, mas a minha felicidade se da pelas etapas que eu fui alcançando enquanto eu estava nesse processo de relatar o bug. A maneira com que eu lidei com os obstáculos, como eu fui compreendendo aos poucos como o sistema deles funcionava. O resultado é so a consequência.\n\nDepois que eu entendi isso, aquele \"click\" que estava faltando foi preenchido. Parei de estudar com o foco no resultado final do projeto. Parece meio louco o que vou dizer, mas vocês não sabem a felicidade que eu fico quando eu tomo um erro no console e vou pesquisar **PORQUE** esse erro ocorre, e não mais o código pronto para soluciona-lo. Me sinto mais flexível para resolver os problemas, não tenho mais medo. \n\nComo eu venho dizendo, não há nada erro em fazer uma gambiarra no código se você está começando, mas é importante você saber identificar que isto é uma gambiarra, e que provavelmente existem formas melhores de se resolver tal problema. Não há nada errado em copiar um código do Stackoverflow pronto, **desde que você entenda o que esse código está fazendo**.\n\nToda funcionalidade que implemento, eu fico me questionando: Porque isso funcionou ? Porque isso não funcionou ?\n\nO que eu quero dizer é que após um erro acontecer, e você soluciona-lo, é importante você entender de fato porque estava dando erro, e porque/como esse código corrige isso. \n\nO resultado final é legal sim, e deve ser valorizado, mas quando finalizar uma aplicação, pare e pense: De que forma eu lidei com os problemas ? De que forma eu me organizei para concluir esse projeto ? Eu identifiquei pontos que funcionam, mas de uma forma não-performática, e podem ser melhorados ?\n\nGaranto que após essa mudança de pensamento, o aprendizado será mais natural, sem angustia ou ansiedade. Alguém mais já passou por isso ?","status":"published","source_url":null,"created_at":"2022-12-18T01:07:15.369Z","updated_at":"2022-12-18T01:13:00.233Z","published_at":"2022-12-18T01:07:15.379Z","deleted_at":null,"owner_username":"matheuspazinati","tabcoins":6,"children_deep_count":2},{"id":"9f389a9c-3217-4002-8e8f-6622983e7607","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"comunidade-open-source-faz-fork-do-editor-atom-descontinuado-pelo-github","title":"Comunidade open source faz fork do editor Atom, descontinuado pelo GitHub","body":"O Pulsar pretende continuar o desenvolvimento do Atom como um editor multiplataforma (Electron) e super customizável. O repositório do projeto é “pulsar-edit/pulsar” no GitHub.","status":"published","source_url":"https://news.slashdot.org/story/22/12/17/0356207/as-github-retires-atom-open-source-pulsar-continues-its-legacy","created_at":"2022-12-19T14:13:22.340Z","updated_at":"2022-12-19T14:13:22.340Z","published_at":"2022-12-19T14:13:22.349Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":5,"children_deep_count":3},{"id":"211bcf19-d135-4f0d-a20e-871ea95cb1fd","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"google-cria-tradutor-de-caligrafia-incompreensivel-de-medicos","title":"Google cria “tradutor” de caligrafia incompreensível de médicos","body":"O recurso será adicionado ao Google Lens e conseguirá detectar medicamentos listados em receitas médicas.\n\n![Um executivo do Google apresentando o novo recurso para uma plateia em um evento. Atrás ele, há uma tela mostrando a fotografia de uma receita médica.](https://techcrunch.com/wp-content/uploads/2022/12/google-doctors-handwriting.jpg)\n\n*O novo recurso foi apresentado na conferência anual da empresa na Índia.*","status":"published","source_url":"https://techcrunch.com/2022/12/18/google-can-now-decode-doctors-bad-handwriting/","created_at":"2022-12-19T14:07:14.718Z","updated_at":"2022-12-19T14:07:14.718Z","published_at":"2022-12-19T14:07:14.729Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":5,"children_deep_count":4},{"id":"47963630-d988-4a94-84f3-43f7721a15b7","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"john-carmack-pede-demissao-da-meta-fazendo-criticas-graves-a-gestao-da-empresa","title":"John Carmack pede demissão da Meta fazendo críticas graves à gestão da empresa","body":"O lendário programador lamentou-se da “quantidade ridícula de pessoas e recursos” sendo constantemente “autossabotados e desperdiçados”. Carmack não conseguiu emplacar sua visão de um dispositivo de realidade virtual “super barato e leve”, o oposto do recém-lançado Quest Pro.","status":"published","source_url":"https://arstechnica.com/gaming/2022/12/john-carmack-leaves-meta-after-a-decade-fighting-to-make-vr-a-reality/","created_at":"2022-12-19T14:00:31.526Z","updated_at":"2022-12-19T14:00:31.526Z","published_at":"2022-12-19T14:00:31.535Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":4,"children_deep_count":5},{"id":"d96574b3-74a8-4115-82b5-f360bdcbd4d2","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"alemanha-tera-primeiro-computador-em-exoescala-do-continente-europeu","title":"Alemanha terá primeiro computador em exoescala do continente europeu","body":"A arquitetura do JUPITER será baseada em GPUs, com o potencial de executar cálculos para estudos do comportamento de milhões de átomos vibrando em escala quântica e simulações planetárias do clima.","status":"published","source_url":"https://spectrum.ieee.org/europe-s-exascale-supercomputer","created_at":"2022-12-19T14:04:49.768Z","updated_at":"2022-12-19T14:04:49.768Z","published_at":"2022-12-19T14:04:49.777Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":3,"children_deep_count":2},{"id":"b73426c5-74be-428e-ab2c-aee9419c0cc2","owner_id":"9b458c0b-0c21-433f-a8f0-2efd3dd884b1","parent_id":null,"slug":"google-apple-e-mozilla-criarao-novo-benchmark-para-navegadores","title":"Google, Apple e Mozilla criarão novo benchmark para navegadores","body":"O Speedometer 3 medirá de forma mais neutra a responsividade de aplicações web no Chrome, Safari e Firefox. A evolução do projeto pode ser acompanhada no repositório “WebKit/Speedometer” no GitHub.","status":"published","source_url":"https://www.engadget.com/speedometer-3-browser-benchmark-apple-google-mozilla-212957943.html?src=rss","created_at":"2022-12-19T14:02:39.362Z","updated_at":"2022-12-19T14:02:39.362Z","published_at":"2022-12-19T14:02:39.379Z","deleted_at":null,"owner_username":"NewsletterOficial","tabcoins":3,"children_deep_count":1},{"id":"623e7551-8f4c-4de5-8945-d68317913130","owner_id":"f33ef7bd-48b3-49d8-b0d1-ad78c3a6bd2c","parent_id":null,"slug":"php-7-2-sera-requisito-minimo-para-wp-6-2","title":"PHP 7.2 será requisito mínimo para WP 6.2?","body":"<!-- wp:paragraph -->\n<p>Sim, isso é real! Parece que <strong>a partir do WordPress 6.2 a versão mínima do <a href=\"https://felipeelia.com.br/categorias/php-desenvolvimento-web/\">PHP</a> será 7.2</strong>. A última alteração nesse requisito mínimo foi feita em maio de 2019, no WordPress 5.2.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:image {\"align\":\"center\",\"id\":2524,\"width\":450,\"height\":253,\"sizeSlug\":\"full\",\"linkDestination\":\"media\"} -->\n<figure class=\"wp-block-image aligncenter size-full is-resized\"><a href=\"https://felipeelia.com.br/wp-content/uploads/2022/12/meme-gatsy.jpg\"><img src=\"https://felipeelia.com.br/wp-content/uploads/2022/12/meme-gatsy.jpg\" alt=\"\" class=\"wp-image-2524\" width=\"450\" height=\"253\"/></a></figure>\n<!-- /wp:image -->\n\n<!-- wp:paragraph -->\n<p>A atualização não havia acontecido antes porque a equipe estipulou 5% como limite máximo de uso de uma versão. Segundo <a href=\"https://core.trac.wordpress.org/ticket/57345\" target=\"_blank\" rel=\"noreferrer noopener\">este ticket</a>, o uso do PHP 5.6 finalmente diminuiu para além desse número. Como o PHP não possui versão 6 e o uso de PHP 7.0 e 7.1 é ainda mais baixo, a versão mínima seria atualizada para 7.2. Os números também estão disponíveis no <a href=\"https://wordpress.org/about/stats/\" target=\"_blank\" rel=\"noreferrer noopener\">site do WordPress.org</a>.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:quote -->\n<blockquote class=\"wp-block-quote\"><!-- wp:paragraph -->\n<p>Em 17 de dezembro de 2022:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>PHP 5.6 em 4,99% de todos os sites WP<br>PHP 7.0 em 2,68%<br>PHP 7.1 em 1,82%</p>\n<!-- /wp:paragraph --><cite><a href=\"https://core.trac.wordpress.org/ticket/57345\" target=\"_blank\" rel=\"noreferrer noopener\">https://core.trac.wordpress.org/ticket/57345</a></cite></blockquote>\n<!-- /wp:quote -->\n\n<!-- wp:heading {\"align\":\"center\"} -->\n<h2 class=\"wp-block-heading\">WordPress e a linha do tempo do PHP</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Para aumentar a retrocompatibilidade, o WordPress adota uma política bastante restritiva quanto às atualizações de versão do PHP. O PHP 5.2, por exemplo, teve sua última versão lançada em janeiro de 2011, mas só deixou de receber suporte pelo core do WP em 2019.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>O PHP 5.6 teve seu <a href=\"https://www.php.net/eol.php\" target=\"_blank\" rel=\"noreferrer noopener\">ciclo encerrado</a> em dezembro de 2018 e hoje, 4 anos depois, ainda é o requisito mínimo do WordPress. Se a atualização de versão mínima acontecer de fato, ainda estaremos para trás: <strong>o PHP 7.2 teve sua última versão lançada em novembro de 2020</strong>, ou seja, há dois anos.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A título de curiosidade, enquanto escrevo este post a versão mais antiga <a href=\"https://www.php.net/supported-versions.php\" target=\"_blank\" rel=\"noreferrer noopener\">ainda recebendo atualizações</a> é o PHP 8.0, com última atualização de segurança prevista para novembro de 2023. A versão mais recente, 8.2, foi lançada este mês e receberá atualizações de segurança até dezembro de 2025.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:table {\"className\":\"is-style-stripes\"} -->\n<figure class=\"wp-block-table is-style-stripes\"><table><thead><tr><th></th><th class=\"has-text-align-center\" data-align=\"center\">Fim do suporte pelo PHP</th><th class=\"has-text-align-center\" data-align=\"center\">Fim do suporte pelo WP</th></tr></thead><tbody><tr><td>PHP 5.2</td><td class=\"has-text-align-center\" data-align=\"center\">01/2011</td><td class=\"has-text-align-center\" data-align=\"center\">05/2019 (WP 5.2)</td></tr><tr><td>PHP 5.6</td><td class=\"has-text-align-center\" data-align=\"center\">12/2018</td><td class=\"has-text-align-center\" data-align=\"center\">??/2023 (WP 6.2)</td></tr><tr><td>PHP 7.2</td><td class=\"has-text-align-center\" data-align=\"center\">11/2020</td><td class=\"has-text-align-center\" data-align=\"center\"></td></tr><tr><td>PHP 8.0 (versão atual)</td><td class=\"has-text-align-center\" data-align=\"center\">11/2023</td><td class=\"has-text-align-center\" data-align=\"center\"></td></tr></tbody></table></figure>\n<!-- /wp:table -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">O que a versão do PHP muda para o WordPress</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Além de <strong>melhorias na segurança e velocidade</strong>, a alteração da versão do PHP possibilita também o uso de vários novos recursos, modernizando a base de código e diminuindo possibilidades de <em>bugs</em>.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>Você pode ver a lista completa de recursos que estariam disponíveis para o desenvolvimento do <em>core </em>nestes três links: <a href=\"https://www.php.net/manual/en/migration70.new-features.php\" target=\"_blank\" rel=\"noreferrer noopener\">PHP 7.0</a>, <a href=\"https://www.php.net/manual/en/migration71.new-features.php\" target=\"_blank\" rel=\"noreferrer noopener\">PHP 7.1</a> e <a href=\"https://www.php.net/manual/en/migration72.new-features.php\" target=\"_blank\" rel=\"noreferrer noopener\">PHP 7.2</a>. Seguem abaixo <strong>alguns exemplos</strong> do que ganhamos só de incluir o PHP 7.0 na lista de versões com suporte:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Declarações de tipo de retorno</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>A partir do PHP 7.0 é possível declarar o tipo retornado por uma função ou método:</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:code {\"className\":\"php\"} -->\n<pre class=\"wp-block-code php\"><code>function exemplo( array ...$arrays ): array {}</code></pre>\n<!-- /wp:code -->\n\n<!-- wp:paragraph -->\n<p>Embora isso seja prática comum em outras linguagens, declarações de tipo (tanto em parâmetros quanto no retorno) pode ser novidade para alguns.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A grande vantagem com esse recurso é a <strong>análise estática do código</strong>: mesmo sem executá-lo é possível identificar se uma outra função chamando <code>exemplo()</code> espera ou não receber um <em>array</em>. Se for o caso, o erro pode ser detectado e resolvido antes de executar qualquer outro teste.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>A maioria das IDEs inclusive já fazem essa verificação automaticamente hoje em dia.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Operador de coalescência nula (??)</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Ao invés de escrever</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:code {\"className\":\"php\"} -->\n<pre class=\"wp-block-code php\"><code>$username = isset( $_GET&#91;'user'] ) ? $_GET&#91;'user'] : 'nobody';</code></pre>\n<!-- /wp:code -->\n\n<!-- wp:paragraph -->\n<p>é possível escrever a versão simplificada</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:code {\"className\":\"php\"} -->\n<pre class=\"wp-block-code php\"><code>$username = $_GET&#91;'user'] ?? 'nobody';</code></pre>\n<!-- /wp:code -->\n\n<!-- wp:heading {\"level\":3} -->\n<h3 class=\"wp-block-heading\">Operador \"nave espacial\" (spaceship) (&lt;=&gt;)</h3>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Muito usado em funções comparativas, esse operador retorna -1, 0 ou 1 dependendo do resultado da comparação.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:code {\"className\":\"php\"} -->\n<pre class=\"wp-block-code php\"><code>echo 1 &lt;=&gt; 1; // 0\necho 1 &lt;=&gt; 2; // -1\necho 2 &lt;=&gt; 1; // 1</code></pre>\n<!-- /wp:code -->\n\n<!-- wp:heading -->\n<h2 class=\"wp-block-heading\">Suporte ao PHP 8</h2>\n<!-- /wp:heading -->\n\n<!-- wp:paragraph -->\n<p>Manter suporte para uma faixa tão grande de versões dificulta a modernização. A compatibilidade com PHP 8 (8.0, 8.1 e 8.2) <a href=\"https://make.wordpress.org/core/handbook/references/php-compatibility-and-wordpress-versions/\" target=\"_blank\" rel=\"noreferrer noopener\">ainda está no estágio Beta</a>. Será que deixar de oferecer suporte ao PHP 5.6 dará a equipe o fôlego necessário para oferecer suporte às versões mais novas do PHP? Tomara!</p>\n<!-- /wp:paragraph -->","status":"published","source_url":"https://felipeelia.com.br/php-7-2-sera-requisito-minimo-para-wp-6-2/","created_at":"2022-12-19T12:46:09.918Z","updated_at":"2022-12-19T12:46:09.918Z","published_at":"2022-12-19T12:46:09.930Z","deleted_at":null,"owner_username":"felipeelia","tabcoins":3,"children_deep_count":0},{"id":"58aa5d4e-1bfc-40d0-bb01-4f391986859e","owner_id":"2e4904d6-af17-47a0-9f2b-9b7760971df7","parent_id":null,"slug":"como-eu-consegui-um-freelance-em-dolar-em-menos-de-24-horas","title":"💵 Como eu Consegui um Freelance em Dólar em Menos de 24 Horas","body":"<br>\n\n## Olá amigos!\n\nMe chamo Lucas Bezerra, e não estou aqui para te vender nenhum curso nem ganhar dinheiro com este conhecimento que vou te passar.\n\nO meu único objetivo com este post é mostrar para todos programadores iniciantes que tem uma capacidade técnica, mas estão perdidos na hora de monetizar o seu conhecimento (da mesma forma que eu estava há uns meses atrás).\n\nAqui, eu vou te ensinar a forma que eu usei para ganhar dinheiro com programação do jeito mais inteligente, rápido e eficaz que consegui encontrar.\n\n<br>\n\n## O que é Freelance?\n\n**Freelance** é uma modalidade de trabalho onde empresas e pessoas físicas te contratam para fazer um trabalho pontual.\n\nImagine que você é o dono de um restaurante e analisando o fluxo de pessoas no estabelecimento, você repara uma coisa restranha: de segunda a quinta, há pouquíssimo movimento, algumas ou outras pessoas frequentam o restaurante, e no geral, é bem parado e monótono.\n\nPorém, aos finais de semana, a situação muda completamente: milhares de pessoas fazendo fila na porta do seu restaurante esperando para serem atendidas, correria dos garçons correndo e tropecando por todo lado - um verdadeiro caos.\n\nOra, você como uma pessoa muito inteligente (tenho certeza que é), repara que o grande problema está na quantidade de funcionários da sua empresa, que durante a semana sobram, e de sexta a domingo faltam. Como resolver então? \n\nA solução é contratar um garçom **freelancer**. Ele não receberá um salário fixo todos os meses, mas sempre que o restaurante estiver superlotado, basta ligar para ele, que cobrando o preço de uma diária de trabalho, supre as suas necessidades sem precisar gerar um gasto desnecessário para a empresa.\n\nSe você prestar atenção neste exemplo, fica claro: o freelancer é um trabalhador que supre uma necessidade específica e pontual de uma empresa.\n\n<br>\n\n## Como Encontrar Clientes?\n\nExistem plataformas focadas em conectar freelancers e empresas. Estas plataformas podem funcionar de jeitos levemente diferentes entre si, mas geralmente funciona do seguinte jeito:\n\n1. Você cria um perfil explicando o que você sabe fazer, quais tecnologias e meios utiliza.\n2. O site te exibirá uma lista de trabalhos disponíveis.\n3. Você se candidata ao trabalho e envia uma proposta.\n4. A empresa analisa sua proposta e de outros freelancers e escolhe qual vale mais a pena para ela.\n\n<br>\n\n## Lista de Plataformas de Freelance\n\nEu criei meu perfil em todas estas que estou deixando o link, mas a que realmente me fez focar minha energia e que me trouxe resultados foi a **UpWork**, acredito que seja uma das maiores do mundo, é bem simples e intuitiva e se vocês quiserem eu trago um tutorial falando sobre ela mais a fundo.\n\nUpwork - https://www.upwork.com\nWorkana - https://www.workana.com\nFreelancer - https://www.freelancer.com\nGetNinjas - https://www.getninjas.com.br\n99Freelas - https://www.99freelas.com.br\nGlassdoor - https://www.glassdoor.com.br/\nTopTal - https://www.toptal.com\nVIbbra - https://www.vibbra.com.br\n\n<br>\n\n## Minha Experiência Pessoal\n\nCerto dia, eu estava extremamente determinado a conseguir ganhar dinheiro com meus conhecimentos em programação. Então eu criei uma conta em todas plataformas de freelance que consegui encontrar pela internet à fora.\n\nPassei o dia inteiro criando perfis, escrevendo sobre minha experiência, cursos e projetos pessoais. Tudo isso durou mais ou menos das 07h da manhã até as 21h da noite (sim, foi um esforço quase compulsivo), porém me rendeu bons resultados pois às 01h da manhã do dia seguinte, depois de dezenas de \"nãos\", uma das propostas finalmente recebeu um retorno positivo!\n\nE desde então venho trabalhando e evoluindo dentro do UpWork, espero continuar contando essa jornada para vocês aqui no TabNews!","status":"published","source_url":null,"created_at":"2022-12-14T13:36:01.807Z","updated_at":"2022-12-15T13:09:25.085Z","published_at":"2022-12-14T13:36:01.826Z","deleted_at":null,"owner_username":"bezerralucas","tabcoins":53,"children_deep_count":85},{"id":"a3624de5-25dc-4f24-aa3b-76cfb9aa1fd7","owner_id":"50853b57-d6fa-4272-afb6-976cf28b91e5","parent_id":null,"slug":"css-menu-dropdown-usando-apenas-css","title":"[CSS] Menu Dropdown usando apenas CSS.","body":"## Introdução\n\nHoje venho apresentar um projeto de um menu dropdown (menu que aparece logo abaixo quando um botão é apertado) com apenas **CSS** na sua construção, usando pseudo-classes no lugar da famosa classe \"active\".\n\n![full-menu-preview-image](https://i.ibb.co/T1Fx30Q/menu-trigger-preview-on-1.png)\n\nO objetivo desse post é desmistificar para programadores **Front-End** iniciantes (ou não)  que muitas vezes tendem a pensar que a solução de certo problema específico é encontrado apenas no **script** sendo que, muitas vezes a solução já existe no **CSS** (até com menos dor de cabeça).\n\nO projeto no **Codepen** pode ser encontrado neste [**link**](https://codepen.io/reinaldorm/pen/dyKEdJM) caso queira apenas passar o olho no código e ver o projeto funcionando, abaixo estará a explicação do projeto. Não aconselho a leitura para pessoas mais experientes em **CSS** pois a explicação será extensa e ira conter conceitos bem básicos como **seletores**, **pseudo-classes** e **métodos** .\n\n## Sumário\n\nImportante freezar que este projeto só é possível graças ao seletor de [_irmão adjacente_](https://developer.mozilla.org/en-US/docs/Web/CSS/Adjacent_sibling_combinator), caracterizado pelo sinal de mais (+).\n\n```css\ndiv + a {\n  background: red;\n}\n```\n\nEste seletor permite selecionar todo elemento que for seguido do elemento passado **inicialmente** no seletor. No exemplo acima, estamos definindo um fundo vermelho para todo elemento `<a>` que estiver logo após uma `<div>`, está ordem sera definida pelo código encontrado no **documento HTML**.\n\n```html\n<div></div>\n<a class=\"home\">Home</a>\n<section></section>\n<a class=\"about\">About</a>\n```\n\n> `<a>` que contém a classe _home_ será selecionado, já o que possúi a classe _about_ não.\n\n<hr>\n\nO projeto também utiliza [pseudo-classes](https://developer.mozilla.org/pt-BR/docs/Web/CSS/Pseudo-classes) como `:active`, que permite aplicar estilos a um elemento no momento em que o mesmo está sendo **pressionado**, outra **pseudo-classe** utilizada é o `:hover` que seleciona o elemento no momento em que o ponteiro **paira** por cima dele.\n\nA **syntáxe** de uma **pseudo-classe** é como no exemplo abaixo.\n\n```css\n  .Menu:active {\n    opacity: 50%;\n  }\n```\n\n> _Menu_ tera sua opacidade reduzida na metade quando o mesmo for pressionado.\n\n<hr>\n\n## O código HTML\n\nO projeto se inicia apenas com uma `<div>` que tem papel de segurar todo nosso menu no código, essa `<div>` recebe a classe de _menu_.\n\n```html\n  <div class=\"menu\"></div>\n```\n\nDentro do nosso menu teremos dois elementos **essenciais** que seram eles um `<button>`, o qual acionara o nosso menu, e um **elemento** especial que fara sentido mais pra frente na explicação mas no momento, sera apenas uma `<div>` qualquer que receberá de início seu display como `none`.\n\n`<button>` ira receber a classe _open-menu_ e a nossa `<div>` ira receber _menu-trigger_.\n\n```html\n  <div class=\"menu\">\n    <button class=\"open-menu\" type=\"button\">\n      Menu\n    </button>\n    <div class=\"menu-trigger\"></div>\n  </div>\n```\n\n> Note que _menu-trigger_ está logo após _open-menu_ no código.\n\nE por último mas não menos importante, teremos a navegação do menu que receberá a classe _nav-menu_, e seus items com a classe _nav-menu-item_.\n\n```html\n  <div class=\"menu\">\n    <button class=\"open-menu\" type=\"button\">\n      Menu\n    </button>\n    <div class=\"menu-trigger\"></div>\n    <ul class=\"nav-menu\">\n      <li class=\"nav-menu-item\">Edit</li>\n      <li class=\"nav-menu-item\">Duplicate</li>\n      <li class=\"nav-menu-item\">Archive</li>\n      <li class=\"nav-menu-item\">Move</li>\n      <li class=\"nav-menu-item\">Share</li>\n      <li class=\"nav-menu-item\">Add to favorites</li>\n      <li class=\"nav-menu-item\">Delete</li>\n    </ul>\n  </div>\n```\n\n> _nav-menu_ também receberá seu display como `none` para ser ativado posteriormente.\n\nO que temos até agora considerando nossas propiedades de estilo **já** foram aplicadas no **CSS** é o seguinte.\n\n![menu-preview](https://i.ibb.co/0C1tWhN/menu-preview.png)\n\n> Apenas nosso `<button>` _open-menu_ é possível de ser visualizado de inicio.\n\n## O código CSS\n\nPara melhor entendimento e também não deixar a explicação mais extensa, não irei citar aqui as propiedades referentes ao **estilo** do nosso menu, apenas aquelas que forem **essenciais** para o funcionamento do mesmo.\n\n<hr>\n\nNossa `<div>` _menu_ irá receber de _importante_ apenas uma mudança no seu **fluxo** de posicionamento que passará a ser `relative` e não mais `static`, isso nos ajudara a posicionar outros elementos no futuro.\n\n```css\n  .menu {\n    position: relative;\n  }\n```\n\nNossa navegação terá de **essencial** apenas os seguintes estilos:\n\n```css\n  .nav-menu {\n    opacity: 0;\n    position: absolute;\n    pointer-events: none;\n  }\n```\n\nEsses estilos iram **garantir** primeiro que nossa navegação não seja visível inicialmente e que não possa ser alvo de [**eventos de ponteiro**](https://developer.mozilla.org/pt-BR/docs/Web/CSS/pointer-events) (para que o usuário não consiga clicar nos seus items sem a navegação está ativada) e também tera seu **fluxo** de posicionamento alterado com seu **position** definido como `absolute` para garantir que seu conteúdo sobreponha tudo e que seu tamanho não influêncie no posicionamento dos demais elementos na tela.\n\n<hr>\n\nAgora aqui é onde a **mágica** começa a acontecer pois, teremos no nosso `<button>` _open-menu_, propiedades no seu estado `:active` que influenciaram no comportamento daquela nossa `<div>` _menu-trigger_ especial usando o seletor de _irmao adjacente_ do **CSS** ( `+` ).\n\n```css\n  .open-menu:active + .menu-trigger {\n    display: block;\n  }\n```\n\nNo exemplo acima estamos dizendo que, quando nosso elemento `<button>` _open-menu_ estiver sendo **pressionado**, queremos que o próximo **elemento** a ele receba a propiedade de **display** definida como `block`. \n\nComo dito mais acima, sabemos que o próximo elemento a ele é a nossa `<div>` _menu-trigger_ especial que até então estava com seu **display** definido como `none`.\n\nOs estilos **essenciais** contidos nessa `<div>` são o seguinte.\n\n```css\n  .menu-trigger {\n    width: 100%;\n    height: 100%;\n    opacity: 0;\n    display: none;\n    position: absolute;\n    top: 0;\n  }\n```\n\nEsses estilos garantem que `<div>` _menu-trigger_ se comporte da seguinte maneira quando for ativado.\n\n![menu-trigger-preview-off](https://i.ibb.co/zV5N9yW/menu-trigger-preview-on.png)\n\nNo momento em que `<button>` _open-menu_ é pressionado, _menu-trigger_ passa a poder ser visualizado e **interagido** pelo usuário.\n\n> No exemplo acima, _menu-trigger_ pode ser visualizado como um retangulo azul que cobre todo nosso `<button>` porém, no projeto final iremos utilizar apenas sua habilidade de interação com o usuário, seu estilo final será invisivel (`opacity: 0%;`) independente se estiver com display `none` ou `block`.\n\nAgora, _menu-trigger_ se mantém ativo enquanto o ponteiro estiver pairando por cima dele, mas como isso é possível?\n\nSimples, temos na nossa `<div>` _menu-trigger_ os seguintes estilos quando o ponteiro está em cima da mesma:\n\n```css\n  .menu-trigger:hover {\n    display: block;\n  }\n```\n\nEntão o que acontece aqui é o seguinte, quando o usuário **pressiona** o `<button>` _open-menu_, nossa `<div>` _menu-trigger_ aparece e **sobrepõe** o `<button>` e, já que o ponteiro já estava acima dele, automaticamente os estilos contidos no estado de `:hover` de _menu-trigger_ é ativado o que faz com que o mesmo se mantenha com display `block` enquanto o mouse **pairar** sobre ele.\n\n> Lembrando que no projeto em sí a `<div>` _menu-trigger_ possui sua opacidade zerada porém, sua interação é **preservada**. \n\n<hr>\n\nE para completar, o mesmo fluxo de eventos que acontecem com o `<button>` _open-menu_ e a `<div>` _menu-trigger_, acontece com a `<ul>` _nav-menu_ e _menu-trigger_.\n\nQuando a `<div>` _menu-trigger_ é pairada pelo ponteiro, além de aplicar os estilos a ela mesma de display `block`, também ativa o seguintes código:\n\n```css\n  .menu-trigger:hover + .nav-menu {\n    pointer-events: auto;\n    opacity: 100%;\n  }\n```\n\nQue diz que, quando _menu-trigger_ estiver no estado de `:hover`, então o próximo elemento a ele (que no caso será o nosso menu) terá seus eventos de ponteiro restabelecidos e sua opacidade será de cem porcento.\n\n> Mas para que restabelecemos os eventos de ponteiro da nossa navegação?\n\nSimples, na nossa navegação temos estilos específicos que só seram aplicados quando nosso menu estiver no estado de `:hover`, que no final irá usar a mesma lógica que foi usada para ativar a `<div>` _menu-trigger_ e manter a mesma ativada.\n\n```css\n  .nav-menu:hover {\n    pointer-events: initial;\n    opacity: 1;\n  }\n```\n\nOs eventos de ponteiro sendo restaurados só nesse momento, garante que a navegação só será visível depois que o fluxo de eventos do `<button>` _open-menu_ e da `<div>` _menu-trigger_ acontecer e o usuário manter o mouse pairando acima ou da navegação em sí, ou acima de _menu-trigger_.\n\nToda essa estrutura resulta no seguinte comportamento:\n\n![full-menu-preview](https://media0.giphy.com/media/n91CIQIQMaYwcGkT9r/giphy.gif?cid=790b761131d39fcde739d4f14c74d4d1174ffefda6d6c296&rid=giphy.gif&ct=g)\n\n\n## Conclusão\n\nEsse projeto não tem como fim o uso do mesmo em projetos reais, o objetivo aqui é apenas mostrar que não existe solução única para um problema e que não existe ferramente única para resolução do mesmo.\n\nA vontade de fazer esse projeto vem de uma frustação antiga minha de quando eu achava que tudo que era relacionado com interação só era possível usando **JavaScript** quando na verdade não é bem assim. Existem interações simples que podem sim ser feitas com **CSS** em projetos reais sem prejudicar a **experiência** do usuário (**UX**).\n\nEnfim, obrigado quem chegou até aqui e espero ter contribúido para sua evolução seja lá de qual for a maneira, futuramente irei trazer mais desse tipo de conteúdo, um abraço.","status":"published","source_url":"https://codepen.io/reinaldorm/pen/dyKEdJM","created_at":"2022-12-13T10:32:47.730Z","updated_at":"2022-12-14T12:57:49.579Z","published_at":"2022-12-13T10:32:47.749Z","deleted_at":null,"owner_username":"reinaldohrm","tabcoins":28,"children_deep_count":17},{"id":"94fb6b62-1989-481d-b152-1e0887f5082a","owner_id":"7b9d7bc8-cce2-4c7e-98d2-8d70914fd72c","parent_id":null,"slug":"como-ser-um-melhor-liderado","title":"Como ser um melhor liderado?","body":"É isso mesmo. Melhor liderado. Normalmente vemos aos montes conteúdos de como liderar, como ser um melhor líder. E isso é ótimo. Precisamos cada vez mais de melhores líderes.\nMas... o líder também precisa de um bom time e por \"bom\" ultrapassa e muito apenas as conhecidas \"hard skills\".\n\nBom, antes de tudo precisamos entender o motivo de estarmos em um time. Acha óbvio a resposta? Talvez não seja tão assim. E o motivo para isso talvez uma adaptação do termo financeiro \"second level thinking\" ou \"segundo nível de pensamento\", criado por Howard Marks. Em resumo é pensar diferente e um pouco além do convencional. Não vou me estender, [vou deixar o link do próprio falando sobre](https://www.youtube.com/watch?v=FqC_dyO6Ioo).\n\n### Como isso se aplica?\n\nVocê está em um novo time, mas qual sua missão dentro do time? Obviamente, executar de forma bem feito tuas tarefas, certo? Certíssimo. Mas só?\nTeu objetivo principal é **facilitar a vida dos teus colegas de equipe**. \n\nExemplo? Teu líder é obviamente extremamente ocupado, o que muitas vezes pode implicar uma certa distância da equipe. Acredite em mim, ele sabe disso e isso incomoda ele.\nO que pode ser feito para ajudar? Sabe lidar com cliente? Converse com ele, tome a frente de reuniões que ele não possa estar. Se torno co-dono do projeto, procure entender o que teus colegas estão trabalhando e em que pode ajudar.\nEm determinados momentos, pode ser necessário que você lidere a daily. E naturalmente isso acontecerá.\n\n**Espera aí... mas isso é trabalho de líder e eu não sou pago pra isso!**\n\nQuantas vezes ouvimos isso?\nE eu posso falar por experiencia própria. Nunca recebi uma promoção de cargo que eu já não estava atuando ou mostrando ser capaz de exercer antes da oficialização.\nEsse tipo de pensamento é o motivo que muitos de nossos colegas reclamam de não receber o sonhado aumento, ou promoção.\n**Se apresente para ser útil dentro do time**. Fazer bem feito tuas tarefas é um excelente começo, mas é o começo e é o que esperam de você. Essa é a verdade.","status":"published","source_url":null,"created_at":"2022-12-13T15:09:39.396Z","updated_at":"2022-12-13T15:09:39.396Z","published_at":"2022-12-13T15:09:39.403Z","deleted_at":null,"owner_username":"ojessecruz","tabcoins":27,"children_deep_count":16},{"id":"80aad5ff-ea8e-43ba-a1ad-85b4266adfa3","owner_id":"897e94c1-ffbb-42a1-bbca-4ac2120dac12","parent_id":null,"slug":"11-dicas-para-ser-mais-focado-e-produtivo","title":"🕰️11 dicas para ser mais focado e produtivo!","body":"Você já se sentiu como se estivesse girando, tentando fazer mais, mas incapaz de fazer qualquer progresso real? Ser produtivo é uma habilidade que pode ser aprendida e, se você deseja aumentar sua produtividade, seguindo essas dicas simples, você pode aumentar sua produtividade e fazer mais em menos tempo. Manter o foco e a organização ajudará você a aproveitar ao máximo seu tempo e alcançar seus objetivos mais rapidamente.\n\n1.  Priorize suas tarefas: é importante identificar quais tarefas são mais importantes e precisam ser realizadas primeiro. Faça uma lista de todas as tarefas que você precisa concluir e priorize-as com base na importância de cada uma. Isso ajudará você a se concentrar primeiro nas tarefas mais importantes e a se manter organizado. Defina metas claras e priorize: determine quais tarefas são as mais importantes e defina metas para sua conclusão. Priorizar suas tarefas ajudará você a se manter no caminho certo e a fazer melhor uso do seu tempo.\n\n2. Crie um cronograma e cumpra-o: agendar o seu dia e cumpri-lo ajudará você a se manter produtivo e focado nas tarefas que precisam ser realizadas. Estabeleça metas: definir metas pequenas e alcançáveis pode ajudá-lo a se manter motivado e focado. Reserve um tempo para dividir seus objetivos maiores em etapas menores e gerenciáveis que você pode realizar todos os dias.\n\n\n3. Faça pausas: as pausas são essenciais para manter o foco e a produtividade. Fazer pausas curtas ao longo do dia pode ajudá-lo a manter-se energizado e focado na tarefa em questão. Fazer pausas regulares pode ajudá-lo a se manter atualizado e focado, além de ajudar a reduzir o estresse.\n\n4. Exercite-se: exercite-se regularmente para melhorar seu humor e aumentar seus níveis de energia.\n\n5. Elimine as distrações: Distrações como mídia social, e-mails e telefonemas podem atrapalhar rapidamente sua produtividade. Desative as notificações e evite a multitarefa para manter o foco na tarefa em questão.\n\n\n6. Utilize a tecnologia: A tecnologia pode ser um grande trunfo quando se trata de se manter produtivo. Utilize ferramentas como gerenciadores de tarefas e aplicativos de produtividade para ajudar a acompanhar as tarefas e se manter organizado.\n\n7. Delegue Tarefas: Não tenha medo de pedir ajuda ou delegar tarefas a outras pessoas. Isso liberará seu tempo para se concentrar nas tarefas mais importantes.\n\n8. Não procrastine: adiar as tarefas só leva ao aumento do estresse e à diminuição da produtividade. Resolva as tarefas o mais rápido possível para permanecer no caminho certo e permanecer produtivo. Certifique-se de agendar horários específicos ao longo do dia para se concentrar em cada tarefa. Isso ajudará você a se manter organizado e no caminho certo.\n\n9. Alimente-se de forma saudável: coma refeições saudáveis e balanceadas que forneçam ao seu corpo o combustível necessário para manter o foco.\n\n10. Durma o suficiente: durma e descanse o suficiente para que seu corpo e sua mente possam recarregar.\n\n11. Mantenha-se organizado: certifique-se de que seu espaço de trabalho e calendário estejam organizados e atualizados para que você saiba o que precisa ser feito e quando.\n\n\nSeguindo essas dicas simples, você pode aumentar sua produtividade e fazer mais em menos tempo. Manter o foco e a organização ajudará você a aproveitar ao máximo seu tempo e alcançar seus objetivos mais rapidamente.\n\n--------------------------------------------------------------------------\n**Agora um anúncio importante**\n\nHá pouco tempo abrimos um servidor dedicado a linguagem Rust, caso estude, trabalhe ou se interesse pela linguagem deixo o link aqui para que se junte a comunidade: =>https://discord.gg/Ma5nNmc6Mn","status":"published","source_url":null,"created_at":"2022-12-12T21:30:26.267Z","updated_at":"2022-12-12T21:38:17.811Z","published_at":"2022-12-12T21:30:26.285Z","deleted_at":null,"owner_username":"Diletante","tabcoins":23,"children_deep_count":29},{"id":"26e4a041-1c21-454f-97c4-298296ec1c43","owner_id":"a824cd1f-56c3-4554-8613-f62209083524","parent_id":null,"slug":"como-evoluir-na-carreira-sendo-timido-introvertido","title":"Como Evoluir na Carreira Sendo Tímido Introvertido?","body":"### Hello World!\n\nAntes de mais nada essa publicação não terá a resposta. Na verdade essa minha primeira publicação que escrevo em qualquer rede social. E Antes que pensem não tenho, eu uso a maioria, mas em grande parte mais como expectador. Tenho poucas publicações e a maioria no instagram, que basicamente posto algumas fotos raramente e com muita dificuldade.\nMas voltando ao ponto principal, para nós, pessoas tímidas e introvertidas é muito difícil lidar com várias situações na vida, e principalmente no ambiente profissional. Falar em reuniões com o time e clientes até mesmo mandar um e-mail acaba sendo muito desconfortável. \nNesse cenário acabamos até mesmo perdendo a oportunidade verem o nosso trabalho e consequentemente evoluirmos como profissional.\n\nAcho que muitas pessoas passam pela mesma coisa que tenho passado. Mas a realidade é que essa timidez que temos, de alguma forma deve ser trabalhada. \nÉ claro que existem profissionais para isso. Mas o que tenho feito é tentar não se importar com o que vão pensar de mim, e dar o meu melhor em tudo. Tentar ser menos perfeccionista possível (e ser perfeccionista não é uma qualidade).\nE saber que vamos ser criticados e isso faz parte. Mas devemos superar e não levar para lado pessoal e sim tentar tirar o melhor proveito para tentar evoluir.\n\nEu querendo em um futuro ser um desenvolvedor, comecei a tentar melhor minhas habilidades interpessoais, trabalhar minha ansiedade, e buscar ter mais foco. \n\nAbaixo um pouco do que tenho feito tentar melhorar:\n\n- Não ser perfeccionista.\n- Saber que é normalmente não saber alguma coisa.\n- Buscar ser mais paciente.\n- Conversar mais com pessoas pessoalmente.\n- Não se importar com o que vão pensar.\n- Se colocar em situações em que faça trabalhar a timidez (conduzir a reuniões e apresentar os resultados por exemplo).\n- Não ter medo de ser visto. \n- Pensar menos (essa parece ser estranha, mas quando penso muito acabo não fazendo)","status":"published","source_url":null,"created_at":"2022-12-14T16:14:43.275Z","updated_at":"2022-12-14T16:14:43.275Z","published_at":"2022-12-14T16:14:43.291Z","deleted_at":null,"owner_username":"mfchaves","tabcoins":22,"children_deep_count":29},{"id":"1bc8c245-34fe-4307-a666-0e4e08de9646","owner_id":"6ae3946e-a574-4c50-a38d-a27a600d303b","parent_id":null,"slug":"sites-uteis-em-escala-para-voce-programador","title":"Sites úteis em escala para você programador","body":"- Sites para Procuras de Imagens\n    \n    [Vecteezy](https://www.vecteezy.com) - esse site trabalha em vetores de imagens\n    \n    [Pixabay](https://pixabay.com/pt/) - esse site tem um banco de imagens populares\n    \n    [Pexels](https://www.pexels.com/pt-br/) - fotos profissionais\n    \n    [PNGWing](https://www.pngwing.com/pt) - pngs simples sem fundo\n    \n    [Freepik](https://br.freepik.com) - imagens e vetores \n    \n    [PngPix](https://www.pngpix.com) - baixe imagens sem fundo\n    \n    [PngEgg](https://www.pngegg.com/pt) - também baixe imagens sem fundo\n    \n    [Wallpaper Flare](https://www.wallpaperflare.com) - Imagens em HD para wallpapers\n    \n    [Wallpaper Acess](https://wallpaperaccess.com) - Imagens em 4K para seus wallpapers\n    \n    [Adobe Color](https://color.adobe.com/pt/explore) - paletas de cores de imagens\n    \n    \n    \n    \n- Sites para Edições de Imagens\n    \n    [Photopea](https://www.photopea.com) - o mesmo photoshop, online e gratuito\n    \n    [Polotno](https://studio.polotno.com) - editor de fotos, tipo um canvas pro, muito melhor e gratuito\n    \n    [Fotor](https://www.fotor.com/pt/) - editor de fotos, online e com ferramentas úteis\n    \n    [SumoAPP](https://sumo.app) - editor de fotos, online, tipo o photoshop\n    \n    [Pixelied](https://pixelied.com) - editor de fotos online com biblioteca de templates\n    \n    [PlaceIt](https://placeit.net)  - coloque imagens em lugares especificos\n    \n    [EditPhoto](https://edit.photo) - mais um editor de imagem porém pra editar imagens msm sabe\n    \n    [ContentDrips](https://contentdrips.com) - edite imagens em carrosel para redes sociais\n    \n    [Visme](https://dashboard.visme.co/v2/) - crie imagens, apresentações, infográficos, social media, videos\n    \n    [Artboard Studio](https://artboard.studio) - pense num photoshop otimizado e com uma biblioteca gratuita\n    \n    [VistaCreate](https://create.vista.com/pt/home/) - crie imagens para redes sociais\n    \n    [PikToChart](https://create.piktochart.com/teams/28021307/dashboard) - crie imagens, apresentações, flyers, posters e muito mais com templates\n    \n    [WdFlat](https://wdflat.com) - faça overlays para suas streams\n    \n    [ClipDrop](https://clipdrop.co) - removedor de fundo com IA, aumenta qualidade, limpa imagens. \n    \n    [PicWish](https://picwish.com) - uma IA, que remove fundo, edita fundo, aumenta qualidade e colore fotos.\n    \n    [Magic Eraser](https://www.magiceraser.io) - remove objetos de uma imagem com IA\n    \n    [CleanUpPictures](https://cleanup.pictures) - remove objetos de uma imagem\n    \n    [Previewed](https://previewed.app) - Cria mockups de celulares pra sua arte\n    \n    [Profile Pic Maker](https://pfpmaker.com) - Cria papeis de parede pra sua foto de perfil profissional\n    \n    [Promo.com](https://promo.com/tools/image-resizer/) - imagem resizer para suas redes sociais especificas\n    \n    [PixelHunter](https://pixelhunter.io) - redimensiona as imagens para diversos tamanhos\n    \n    [ImResizer](https://imresizer.com) - transforma uma imagem em cm, mm ou outros tamanhos\n    \n    [Palette Fm](https://palette.fm) - uma inteligência artificial que coloriza foto preta e branco\n    \n    [ToonMe](https://toonme.com) - transforme suas fotos em desenhos\n    \n    [WaterMarkRemove](https://www.watermarkremover.io/pt) - remove a marca d’agua de suas fotos gratis\n    \n    [Squoosh](https://squoosh.app) - reduza o tamanho de uma imagem\n    \n    [AutoCreative](https://auto.creavite.co) - crie perfis e banners personalizados\n    \n    [EasyMova](https://www.easymoza.com) - faça uma foto com várias fotos juntas\n    \n    [BigJpg](https://bigjpg.com) - aumente resoluções das imagens\n    \n\n- - Sites para Edições de Vídeos\n    \n    [ClipChamp](https://app.clipchamp.com) - editor de vídeos, online, sem marca d’agua\n    \n    [Blush Design](https://blush.design/pt) - Conte histórias em animações\n    \n    [Invideo](https://invideo.io) - transforma texto em vídeo\n    \n    [Velosofy](https://www.velosofy.com) - templates de intros gratuitas\n    \n    [Unscreen](https://www.unscreen.com) - remova fundo de vídeos curtos\n    \n    [BgRem](https://bgrem.deelvin.com/pt/) - remova fundo de videos \n    \n    [RenderForest](https://www.renderforest.com/pt/) - faça logos, mockups, intro, sites para sua empresa\n    \n    [PanZoid](https://panzoid.com) - faça vídeos/intros com seu username\n    \n    [Breakout Clips](https://breakoutclips.com/dashboard/videos/) - faça clipes de video em cima de suas imagens\n    \n    [Visme](https://dashboard.visme.co/v2/) - crie imagens, apresentações, infográficos, social media, videos\n    \n    [3dGifMaker](https://www.3dgifmaker.com) - edite gifs para apresentação online\n    \n    [AutoCreative](https://auto.creavite.co) - crie perfis e banners personalizados\n    \n    [Animazer -](https://www.animazer.com) faça videos digitais patrocinados\n\n\n- - Sites para Ícones\n    \n    [Icon Icons](https://icon-icons.com/pt/icone/perna-esporte/12572) - baixe ícones de várias fontes diferentes\n    \n    [Iconer](https://iconer.app) - baixe ícones e personalize-os\n    \n    [Vertex](https://vertex.im) - crie ícones 3d personalizados \n    \n    [Lordicon](https://lordicon.com) - ícones animados personalizados\n    \n    [Flaticons](https://www.flaticon.com/br/) - icones, figurinhas, vetores, icones animados\n    \n    [Icons8](https://icons8.com.br) - icones, ilustrações e photos\n    \n    [IconArchive](https://iconarchive.com) - icones simples\n    \nEspero ter ajudado de alguma forma <3\n\n\nSe quiserem conferir melhor o conteudo: https://xispeh.notion.site/As-ferramentas-mais-teis-dca21ac610644ba5b50a3833b133ff81 ( created: Xispeh )","status":"published","source_url":null,"created_at":"2022-12-13T03:22:38.157Z","updated_at":"2022-12-13T03:22:38.157Z","published_at":"2022-12-13T03:22:38.177Z","deleted_at":null,"owner_username":"johntheshadow","tabcoins":22,"children_deep_count":28},{"id":"9913f3ed-7b11-41f0-9fed-15780bd3a219","owner_id":"07ea33ea-78bd-4578-bad2-1cf5323cab07","parent_id":null,"slug":"riffusion-usando-o-stable-diffusion-para-gerar-musica-atraves-de-espectrogramas","title":"RIFFUSION: Usando o Stable Diffusion para gerar Música (através de espectrogramas)","body":"Turma, esbarrei numa das mais criativas adaptações do **Stable Diffusion** que é o [RIFFUSION](https://www.riffusion.com/about) (uma mistura de `riff` + `diffusion`) onde a idéia é utilizar o mesmo algoritmo de geração de imagens do Stable Diffusion, mas para gerar imagens de **espectrogramas**, que em seguida são convertidas para **músicas**.\n\nVeja nos dois exemplos abaixo, um prompt tradicional gerando a foto de um cavalo, e outro prompt gerando um espectrograma:\n\n|_\"photograph of an astronaut riding a horse\"_|_\"funk bassline with a jazzy saxophone solo\"_|\n|:-:|:-:|\n|![](https://i.imgur.com/3hDi8O8.gif)|![](https://i.imgur.com/Pl65wmu.gif)|\n\nOnde o espectrograma acima irá gerar esta música:\n\nhttps://www.riffusion.com/about/funky_sax.mp3\n\nVocê pode escutar mais músicas e ter uma explicação mais detalhada no link da `Fonte`.","status":"published","source_url":"https://www.riffusion.com/about","created_at":"2022-12-15T17:42:15.546Z","updated_at":"2022-12-15T17:42:15.546Z","published_at":"2022-12-15T17:42:15.570Z","deleted_at":null,"owner_username":"filipedeschamps","tabcoins":20,"children_deep_count":6},{"id":"50f1e2ce-a9ae-4c61-8bdf-06d74231bbab","owner_id":"2e4904d6-af17-47a0-9f2b-9b7760971df7","parent_id":null,"slug":"como-deixar-seus-tabnews-mais-bonitos-e-didaticos-tudo-sobre-markdown","title":"✍ Como Deixar seus Conteúdos Mais Bonitos e Didáticos - Tudo Sobre Markdown","body":"## Aviso\n\nEsse conteúdo é uma tradução da [documentação oficial](https://www.markdownguide.org/basic-syntax/), porém, tomei a liberdade de adicionar minha didática e simplificar para os DEVS.\n\n## O que é Markdown?\n\nVocê provavelmente já utilizou o *Microsoft Word* na sua vida ou algum editor de texto parecido como *LibreOffice Writer*. O que esses editores te permitem fazer? Adicionar títulos, imagens, negrito, itálico e etc. \n\nAgora, imagine que exista uma linguagem universal que quase todos programas de edição de texto entendem e que você pode usar aqui no TabNews para enriquecer seu texto?\n\nBem-vindo ao mundo do Markdown. Nesse guia eu vou te mostrar como utilizar cada pedacinho da sintaxe dessa linguagem de formatação de textos.\n\nA sintaxe básica do Markdown é muito simples e consiste em algumas regras básicas que você pode seguir para criar seus próprios textos em Markdown. Aqui estão as principais sintaxes que você precisa conhecer:\n\n## Títulos\n\nPara criar títulos em Markdown, basta adicionar um ou mais `#` (hashtags) antes do seu título. O número de hashtags que você adiciona determina o nível do título. Por exemplo:\n\nTal como no HTML, temos 6 tipos de títulos diferentes, basta ir adicionando uma hashtag a mais para diminuir o nível do cabeçalho.\n\n***Markdown:***\n\n`# Título 1`\n`## Título 2`\n`### Título 3`\n`#### Título 4`\n`##### Título 5`\n`###### Título 6`\n\n***Resultado:***\n\n# Título 1\n## Título 2\n### Título 3\n#### Título 4\n##### Título 5\n###### Título 6\n\n> **Dica:** sempre dê uma quebra de linha no seu editor de código antes e após o título.\n\n<br>\n## Parágrafos\n\nPara criar parágrafos, basta digitar o texto em uma nova linha, como este.\n\n> **Dica:** nunca use espaços ou tab antes do parágrafo, dessa forma, seu texto vai ficar mais legível e bonito.\n<br>\n\n## Quebra de Linha\n\nUse a tag `<br>` para criar quebras de linha.\n\nExemplo:\n\n```\nLinha 1\n<br>\nLinha 2\n```\n\nGera o resultado:\n\nLinha 1\n<br>\nLinha 2\n<br>\n## Formatação de Texto\n\n### Negrito\n\nPara colocar o texto em negrito, basta envolvê-lo com dois asteriscos ***`**`*** ou dois underlines ***`__`***. Por exemplo:\n\n```\nIsto está em negrito: **estou em negrito**.\nIsto está em negrito: __estou em negrito__.\n```\n\nIsto está em negrito: **estou em negrito**.\nIsto está em negrito: __estou em negrito__.\n\n### Itálico\n\nPara colocar o texto em negrito, basta envolvê-lo com um  ***`*`***, ou um underline ***`_`***. Por exemplo:\n\n```\nIsto está em itálico: *estou em itálico*.\nIsto está em itálico: _estou em itálico_.\n```\n\nIsto está em itálico: *estou em itálico*.\nIsto está em itálico: _estou em itálico_.\n\n### Negrito e Itálico\n\nSegue a mesma regra de ambos, porém juntos, ou seja, três ***`***`*** ou ***`___`***\n\n```\nIsto está ***negrito e itálico***\nIsto está ___negrito e itálico___\n```\n\nIsto está ***negrito e itálico***\nIsto está ___negrito e itálico___\n<br>\n## Citações\n\nAdicione ***`>`*** no começo de cada linha da sua citação.\n\n```\n> Quando vires um homem bom, tenta imitá-lo; quando vires um homem mau, examina-te a ti mesmo.\n> Confúcio\n```\n\nGera o resultado:\n\n> Quando vires um homem bom, tenta imitá-lo; quando vires um homem mau, examina-te a ti mesmo.\n> Confúcio\n<br>\n## Listas\n\n### Listas Ordenadas\n\nSão as listas que têm uma ordem crescente de números. Use a seguinte sintaxe:\n\n```\nTop Linguagens de Programação:\n\n1. Javascript\n2. Python\n3. PHP\n...\n3219451531. PHP\n```\n\nGera o código:\n\nTop Linguagens de Programação:\n\n1. JavaScript\n2. Python\n3. PHP\n...\n3219451531. PHP\n<br>\n## Código\n\nOs blocos de código não aceitam nenhuma das outras funções do markdown, é como uma string literal que não será interpretada pelo site.\n\nUse:\n\n```\n` ` `\nInsira seu código aqui\n\n(Porém, retire os espaços entre os acentos, eu não posso pois iria causar um bug aqui porque isto já é um bloco de código).\n` ` `\n```\n<br>\n## Linhas Horizontais\n\nUse uma série de ***`-`*** ou ***`_`*** em sequência para criar uma linha horizontal:\n\n```\nTexto bacana\n\n-----------------------------\n\nOutro texto bacana\n\nTexto supimpa\n\n_____________________________\n\nOutro texto supimpa\n```\n\nResultado:\n\nTexto bacana\n\n-----------------------------\n\nOutro texto bacana\n\nTexto supimpa\n\n_____________________________\n\nOutro texto supimpa\n<br>\n## Links\n\n### Link Comum\n\nUse ***`[]`*** e insira seu link dentro dos colchetes.\n\n```\nLink do GitHub do Lucas Bezerra: [https://github.com/bezerra-lucas]\n```\n\nResultado:\n\nLink do GitHub do Lucas Bezerra: [https://github.com/bezerra-lucas]\n\n### Link Embutido no Texto\n\nUse ***`[]`*** e insira seu texto dentro dos colchetes, após isso, insira seu link dentro dos ***`()`***.\n\n```\nLink do GitHub do [Lucas Bezerra](https://github.com/bezerra-lucas)\n```\n\nResultado:\n\nLink do GitHub do [Lucas Bezerra](https://github.com/bezerra-lucas)\n\n<br>\n## Imagens\n\nPara inserir uma imagem, use ***`![]()`***, coloque um texto alt dentro dos  ***`[]`*** e o link para imagem no ***`()`***.\n\nCódigo:\n\n```\n![Montanhas Bonitas](https://mdg.imgix.net/assets/images/san-juan-mountains.jpg?auto=format&fit=clip&q=40&w=1080)\n```\n\nExemplo:\n\n![Montanhas Bonitas](https://mdg.imgix.net/assets/images/san-juan-mountains.jpg?auto=format&fit=clip&q=40&w=1080)\n<br>\n## Considerações Finais\n\nEspero que vocês tenham curtido este artigo aqui no TabNews e que seja útil para que vocês criem conteúdo cada vez mais bonito e agradável para nossa querida plataforma. Agradeço a atenção de todos e me desponho a tirar dúvidas aqui nos comentários dessa publicação!\n\nFeito por: [Lucas Bezerra](https://github.com/bezerra)","status":"published","source_url":null,"created_at":"2022-12-15T15:57:46.528Z","updated_at":"2022-12-16T12:56:11.353Z","published_at":"2022-12-15T15:57:46.544Z","deleted_at":null,"owner_username":"bezerralucas","tabcoins":20,"children_deep_count":24},{"id":"174c3a2b-dd21-445f-8d3b-9502d002d408","owner_id":"7da88c1c-e637-42a2-b47a-53c6bb231300","parent_id":null,"slug":"programacao-funcional-resumida","title":"Programação Funcional Resumida","body":"### Introdução\nHoje venho trazer um resumo bem tranquilo para explicar o quê é programação funcional.\nInicialmente, vamos começar fazendo um contraponto com a programação imperativa.\n\n### Programação Imperativa\nNo código seguinte definimos uma função que retorna o quadrado da soma de duas variáveis.\n\n```java\npublic float squared_sum(x,y) {\n\tsum = x+y;\n\tsquared = sum**2;\n\treturn squared\n}\n```\n\nEssa função faz com que o computador guarde na memória a variável soma, a variável squared e os respectivos valores. Esses são chamados *efeitos colaterais*.\n\n### Programação Funcional/Declarativa\nAgora vamos transformar o mesmo código para programação funcional.\n\n```java\npublic float squared_sum(x,y){\n\treturn (x+y)^2;\n}\n```\n\nNote-se que retiramos as variáveis e fizemos todas as operações no próprio return. Essa mudança elimina os *efeitos colaterais* que falamos antes , ou seja, nesse caso não estamos mais ocupando espaço na memória para fazer essa operação.\n\n### Mas o quê é afinal programação funcional?\nProgramação funcional é um método de resolução de problemas que tem como objetivo construir software por meio de composição de funções puras, evitando compartilhamento de estados, dados mutáveis e efeitos colaterais.\n\n#### Funções Puras\nUma função é chamada de pura quando, se invocada mais de uma vez com os mesmos parâmetros, produz exatamente o mesmo resultado.  \nAlém disso, é necessário que ela não cause *efeitos colaterais* externos como imprimir linha de saída, alterar algo no banco, guardar algo na memória, etc.\n\n#### Composição de funções\nCom esses conceitos em mente, podemos fazer composições de funções, tornando nossas operações mais complexas. Pode parecer algo diferente, mas você já pode ter visto em diversas situações. \n\nEm suma, isso significa criar uma nova função por meio da composição de outras. \n\nNo exemplo seguinte temos uma função que filtra um array retirando apenas os números pares e, por fim, multiplicando por 2.\n\n```js\nconst numeros = [2,3,4,5,6,7,8,9,10]\n\nnumeros.filter((numero) => numero % 2 === 0).map((numero) => numero * 2) \n// [ 4, 8, 12, 16, 20 ]\n```\n\n---\n### Fontes\n- https://www.alura.com.br/artigos/programacao-funcional-o-que-e#de-onde-veio-a-ideia-de-programacao-funcional-?\n- https://www.youtube.com/watch?v=08CWw_VD45w (Exemplos)\n\n---\n### Sobre mim:\nEstou compartilhando um pouco das minhas notas sobre os conteúdos que estudo. Se sinta livre para continuar a discussão. Espero que tenha ajudado :)\n\nGithub: https://github.com/JuliaGK","status":"published","source_url":null,"created_at":"2022-12-15T01:50:29.505Z","updated_at":"2022-12-15T01:50:29.505Z","published_at":"2022-12-15T01:50:29.538Z","deleted_at":null,"owner_username":"juliakuchle","tabcoins":19,"children_deep_count":15},{"id":"7f4a5b59-ccc7-46c8-bfe1-1f8235c06f13","owner_id":"98957c1b-4a24-4a2d-8379-b8d82910137e","parent_id":null,"slug":"git-e-github-resumo-de-como-configurar-e-upar-no-github-para-usuarios-intermediarios","title":"Git & GitHub | Resumo de como configurar e Upar no GitHub (Para Usuários Intermediários)","body":"<h2 align=\"center\">\n    <img alt=\"Git and Github\" title=\"\" src=\"https://user-images.githubusercontent.com/53992405/198863123-d59767bc-5b6c-469d-97bc-22805ca36242.png\" width=\"300px\" />\n</h2>\n<p align=\"center\">\n  <h1 align=\"center\">Git | Como configurar e Upar no GitHub</h1>\n</p>\n<p align=\"center\">\n  <a href=\"#instruções\">Instalação</a>&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;\n  <a href=\"#configurando-autenticação-do-git\">Autenticação</a>&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;\n  <a href=\"#escolha-a-maneira-q-você-quer-prosseguir\">Upload para GitHub</a>&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;\n  <a href=\"#em-caso-de-erro-no-git-push\">Erros</a>&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;\n  <a href=\"#comandos-adicionais-mais-técnicos\">Comandos extras</a>&nbsp;&nbsp;&nbsp;|&nbsp;&nbsp;&nbsp;\n</p>\n\n##\nMeu GitHub: [Link](https://github.com/PuniGC)\nGitHub Gist: [Link](https://gist.github.com/PuniGC/3b08a18d9be0cc3075fe68da6566b0d1)\n#### Resumo das explicações\n* Aviso\n* Comandos iniciais (Feito uma única vez)\n```bash\n>   git init\n>   git remote add origin https://github.com/USER/REPO.git\n```\nOu:\n```bash\n>   git clone https://github.com/USER/REPO.git\n```\n\n* Mandar pro GitHub\n```bash\n>   git add .\n>   git commit -m \"Alterações no Menu\"\n>   git push origin main\n```\n\n\n## Instruções\n Troque somente os campos \"**[string]**\" pela informação necessária. \n Ex: \"[nome]\" => \"Gabriel\"\n\n## Tutorial - Instalando o \"Git\"\n* [Video Tutorial](https://www.youtube.com/watch?v=mmcOw2ynWEs)\n* [Windows](https://git-scm.com/download/win)\n* [MacOS](https://git-scm.com/download/mac)\n* [Linux](http://git-scm.com/download/linux)\n\n## Aviso Importante\n> Sempre antes/durante/depois do `\"GIT PUSH ORIGIN MAIN` **REZE PARA DEUS!!!!!!!!**\n\n* Agora o GitHub tem por padrão, o nome da branch como \"main\", ao invés de \"master\", como era usado antigamente, com isso é recomendado na instalação, optar por essa opção abaixo, para facilitar a integração com o GitHub.\n\n![image](https://user-images.githubusercontent.com/53992405/198860022-851e268e-ae0e-4754-9024-fce86503f650.png)\n\nCaso já tenha instalado o Git e inicializado o repositório, você pode trocar de master para main com esse comando:\n\n```bash\n>   git branch -m master main\n```\n\n## Configurando autenticação do \"Git\"\n\nPrimeiro vamos configurar o nosso Git que está localmente. Com nosso nome e e-mail (É recomendado o mesmo do GitHub)\n\n* Configure o nome que você quer para todos os repositórios locais\n\n```bash\n>   git config --global user.name \"[nome]\"\n```\n\n* Configura o e-mail que você quer ligado aos seus commit\n\n```bash\n>   git config --global user.email \"[endereco-de-email]\"\n```\n# Escolha a maneira que você quer prosseguir\n\n## Repositório \"Novo\"\n> Comandos quando devem ser feitos apenas na criação de um novo repositório\n\nEscolha a pasta do projeto e crie o repositório Git com o comando:\n> \n* Cria o repositório local\n```bash\n>   git init\n```\n\n* Linka o repositório remoto, ou seja, linka com o repositório GitHub\nO link pode ser encontra aqui, como mostrado na image:\n\n![image](https://user-images.githubusercontent.com/53992405/198860960-abc03021-ab7b-44af-9b05-5e3cf2771843.png)\nEx: https://github.com/PuniGC/ProjetoEscolaAPI_React-dotnet\n```bash\n> git remote add origin https://github.com/USER/REPO.git\n```\n\n* Agora prossiga com as etapas do repositório existente\n\n## Repositório \"Existente\" no Github\n* Clonar repositório do GitHub\n```bash\n> git clone https://github.com/PuniGC/ProjetoEscolaAPI_React-dotnet\n```\n\n## Repositório \"Existente\" e Comandos para mandar pro GitHub\n\nVamos adicionar os arquivos que podem ser comitados\n\n* Adicionar todos os arquivos\n```bash\n> git add .\n```\nOu\n* Adicionar um único arquivo\n```bash\n> git add index.html\n```\n\nAgora após realizar alguma alteração em nossos arquivos, devemos comitados (Colocar na fila) para serem enviados ao repositório do GitHub\n\n* Confirmar as alterações:\n```bash\n> git commit -m \"[mensagem-que-aparecera-no-github]\"\n```\nRecomendam-se nomes não genéricos, para indicar alterações o motivo da alteração. \nEx: \n```bash\n> git commit -m \"[+] Resolvido Bug no componente Login\" \n```\n\nPor fim, devemos enviar as alterações para o GitHub\n* Enviando alterações\n```bash\n> git push origin main \n```\n\nProntinho, sucessooooo.\n\nObs 1: Sem Observações\nObs 2: A Obs 3 é falsa\nObs 3: A Obs 2 está correta\n\n## EM CASO DE ERRO NO Git Push\n\nPode ser que, você tenha um erro ao tentar dar `git push`, o erro chama-se conflito de merge, e isso acontece quando dois desenvolvedores ou você mesmo, alteram o mesmo trecho de código (em diferentes computadores) e a única maneira de resolver este conflito é através de uma intervenção manual, temos dois computadores que possuem diferentes alterações, é muito comum até em empresas, mas não se preocupe.\n\n![image](https://user-images.githubusercontent.com/53992405/198861666-e8772ead-87cc-4167-873a-c66b96672844.png)\n\nPara resolver isso, siga os seguintes passos:\nCHAMAR O SANTANA, brincadeira kkkkk\n\nEscolha um dos video que explica como resolver esses conflitos, e siga o tutorial, pois é algo um pouco difícil de explicar por texto\n\n* [Video Tutorial - Explicação e Resolução 1#](https://www.youtube.com/watch?v=p5xe1qLDgmo)\n* [Video Tutorial - Explicação e Resolução 2#](https://www.youtube.com/watch?v=PZGJf8YPhtc)\n* [Video Tutorial - Explicação e Resolução 3#](https://www.youtube.com/watch?v=_LOLnJJG1-c)\n\nE provavelmente, após resolver o conflito de merge, o video indicara para você realizar esses comandos para por fim mandar o merge/alterações para o GitHub.\n\n```bash\ngit add .\ngit commit -m \"[+] Resolvendo merge conflit (Nova Feature no SelectMenu)\"\ngit push origin main \n```\n\nEbaaaaaaa... acabou <3\n\n## EM CASO DE OUTROS ERROS\n* Não abra a mão de tudo, PESQUISE!!!, isso, procure o erro na internet, stackoverflow, discord e professores/colegas, não tenha medo ou vergonha disso, é super normal darem esses erros, acredite, até com programadores experientes e comigo kkk, e até mesmo eles dão um Google nessas horas, assim como tudo, pratique, pois a melhor forma de resolver um erro, é evitando ele. E sim, eu sei que isso é algo que abrimos muitas vezes mão de fazer, mas acredite essa é a única maneira de resolver o seu problema, não fique apenas correndo atrás dos outros, foque em apreender e praticar, para que na próxima vez, quem se assuste com o erro, seja ele mesmo.\nAlém disso, você pode me procurar também, seja no Discord ou por E-mail, fico feliz em ajuda, quem saiba eu não ajude a resolver, te ensino e ainda apreendo junto sobre, kkkkkk, a final, todos nos  somos estudantes nessa jornada, só cuidado com a prática do POSDQ - Programação Orientada a Seja o que Deus Quiser.\n\nOutra dica importante, tente procurar erros ou assuntos em inglês, há muito mais conteúdo em inglês devido à linguagem ser umas das principais línguas do mundo, ou seja, tem muito mais soluções escritas e documentadas nessa língua, o que ajuda bastante.\n\n## Git Ignore - Ignorar arquivos (Não mandar esses arquivos do Git local para a GitHub)\nBasta criar um arquivo chamado .gitignore\ne nele colocar os nomes do arquivos\n\n* Mais sobre:\n\nSobre: ​​https://help.github.com/articles/ignoring-files\nModelos úteis: https://github.com/github/gitignore\n\n## Por fim ... Referencias\n- Configuração relacionada: https://gist.github.com/hofmannsven/6814278\n- Dicas profissionais relacionadas: https://ochronus.com/git-tips-from-the-trenches/\n- Tutorial interativo para iniciantes: http://try.github.io/\n- Git Cheatsheet do GitHub: https://training.github.com/downloads/pt_BR/github-git-cheat-sheet/\n\n# Comandos adicionais (+Mais técnicos)\nMostrar conteúdo da pasta: `ls -la`\n\n## Comandos de Ajuda\nVeja onde o Git está localizado:\n`que git`\n\nObtenha a versão do Git:\n`git --version`\n\nCrie um alias (atalho) para `git status`:\n`git config --global alias.st status`\n\nAjuda:\n`git help`\n\n# Comandos adicionais \n\nVerifica qual é o remote atual\n`git remote -v`\n\nAdicione e confirme em uma etapa:\n`git commit -am \"Mensagem\"`\n\nRemova os arquivos do Git:\n`git rm index.html`\n\nAtualize todas as alterações:\n`git add -u`\n\nRemova o arquivo, mas não rastreie mais:\n`git rm --cached index.html`\n\nMover ou renomear arquivos:\n`git mv index.html dir/index_new.html`\n\nDesfazer modificações (restaurar arquivos da última versão confirmada):\n`git checkout -- index.html`\n\nRestaurar arquivo de um commit personalizado (no branch atual):\n`git checkout 6eb715d -- index.html`\n\n## Redefinir\nVolte para o commit:\n`git revert 073791e7dd71b90daa853b2c5acc2c925f02dbc6`\n\nSoft reset (mova apenas HEAD; nem o staging, nem o diretório de trabalho são alterados):\n`git reset --soft 073791e7dd71b90daa853b2c5acc2c925f02dbc6`\n\nDesfazer o último commit: `git reset --soft HEAD~ `\n\nRedefinição mista (mova HEAD e altere o staging para corresponder ao repositório; não afeta o diretório de trabalho):\n`git reset --mixed 073791e7dd71b90daa853b2c5acc2c925f02dbc6`\n\nHard reset (mova HEAD e altere o diretório de teste e o diretório de trabalho para corresponder ao repositório):\n`git reset --hard 073791e7dd71b90daa853b2c5acc2c925f02dbc6`\n\nHard reset de um único arquivo (`@` é a abreviação de `HEAD`):\n`git checkout @ -- index.html`\n\n## Atualizar e excluir\nTeste-exclua arquivos não rastreados:\n`git clean -n`\n\nExcluir arquivos não rastreados (sem preparação):\n`git clean -f`\n\nDesfaça (desfaça adições):\n`git reset HEAD index.html`\n\nAtualize o commit mais recente (atualize também a mensagem do commit):\n`git commit --amend -m \"Nova mensagem\"`\n\n## Ramo\nMostrar ramos:\n`git branch`\n\nCriar filial:\n`git branch branchname`\n\nMudar para filial:\n`git checkout branchname`\n\nCrie e mude para um novo branch:\n`git checkout -b nome do ramo`\n\nrenomear ramo:\n`git branch -m branchname new_branchname` ou:\n`git branch --move branchname new_branchname`\n\nMostrar todas as ramificações completamente mescladas com a ramificação atual:\n`git branch --merged`\n\nExcluir branch mesclado (possível apenas se não for HEAD):\n`git branch -d branchname` ou:\n`git branch --delete branchname`\n\nExcluir branch não mesclado:\n`git branch -D branch_to_delete`\n\n## Mesclar\nMesclagem verdadeira (avanço rápido):\n`git merge branchname`\n\nMesclar para mestre (somente se avançar):\n`git merge --ff-only branchname`\n\nMesclar para master (forçar um novo commit):\n`git merge --no-ff branchname`\n\nParar a mesclagem (em caso de conflitos):\n`git merge --abort`\n\nParar a mesclagem (em caso de conflitos):\n`git reset --merge` //antes da v1.7.4\n\nDesfaça a mesclagem local que ainda não foi enviada:\n`git reset --hard origin/master`\n\nMescle apenas um commit específico:\n`git cherry-pick 073791e7`\n\nRebase:\n`git checkout branchname` » `git rebase master`\nou:\n`git merge master branchname`\n(O rebase move todos os commits em `master` para a ponta de `branchname`.)\n\nCancelar rebase:\n`git rebase --abort`\n\nEsmague vários commits em um:\n`git rebase -i HEAD~3` ([fonte](https://www.devroom.io/2011/07/05/git-squash-your-latests-commits-into-one/))\n\nSquash mescla um branch de recurso (como um commit):\n`git merge --squash branchname` (commit depois)\n\n## Estoque\nColocar em estoque:\n`git stash save \"Mensagem\"`\n\nMostrar estoque:\n`git stash list`\n\nMostrar estatísticas de estoque:\n`git stash show stash@{0}`\n\nMostrar alterações de stash:\n`git stash show -p stash@{0}`\n\nUse o item de stash personalizado e solte-o:\n`git stash pop stash@{0}`\n\nUse um item de stash personalizado e não o deixe cair:\n`git stash apply stash@{0}`\n\nUse o item e o índice do stash personalizados:\n`git stash apply --index`\n\nCriar ramificação do stash:\n`git stash branch new_branch`\n\nExcluir item de stash personalizado:\n`git stash drop stash@{0}`\n\nExcluir stash completo:\n`git stash clear`\n\n##Gitignore & Gitkeep\nAdicione ou edite gitignore:\n`nano.gitignore`\n\nRastrear diretório vazio:\n`touch dir/.gitkeep`\n\n## Registro\nMostrar compromissos:\n`gitlog`\n\nMostrar resumo de uma linha de commits:\n`git log --oneline`\n\nMostrar resumo de uma linha de commits com SHA-1 completo:\n`git log --format=oneline`\n\nMostrar resumo de uma linha dos últimos três commits:\n`git log --oneline -3`\n\nMostrar apenas commits personalizados:\n`git log --author=\"Sven\"`\n`git log --grep=\"Message\"`\n`git log --until=2013-01-01`\n`git log --since=2013-01-01`\n\nMostrar apenas dados personalizados do commit:\n`git log --format=short`\n`git log --format=full`\n`git log --format=f`","status":"published","source_url":"https://gist.github.com/kartikbhargav11/2538c9367b84e02e53d0bf0843e80478","created_at":"2022-12-13T17:32:13.715Z","updated_at":"2022-12-13T20:58:26.882Z","published_at":"2022-12-13T17:32:13.738Z","deleted_at":null,"owner_username":"GabrielSantDev","tabcoins":11,"children_deep_count":13},{"id":"27b2a911-d97d-4a49-89bb-ba0bcf66f5c9","owner_id":"914b0c87-a53f-464d-b8ae-5841e7aa411a","parent_id":null,"slug":"como-usar-um-botao-enviar-fora-de-um-formulario-html","title":"[DICA] Como usar um botão enviar fora de um formulário HTML","body":"Outro dia, tive um cenário bastante estranho em que tínhamos um formulário dentro de uma seção específica, mas o botão enviar estava na parte inferior.\n\nA princípio, tentei reconfigurar o HTML para que o botão fizesse parte do elemento do formulário. No entanto, isso rapidamente se tornou um HTML cheio de CSS pra burlar os padrões.\n\nEntão decidi pesquisar outras opções e aprendi que você pode colocar botões de envio fora de um formulário!\n\nVamos dar uma olhada nisso.\n\n\n## Botão enviar fora de um formulário\n\nPara conseguir isso, devemos usar a seguinte marcação.\n\n```\n<form id=\"newsletterForm\">\n  <label for=\"email\">Email:</label>\n  <input type=\"email\" name=\"email\" placeholder=\"Email\" />\n</form>\n\n<button type=\"submit\" form=\"newsletterForm\">Submit!</button>\n```\n\nComo você pode ver, o botão não faz parte do formulário, mas funcionará.\n\nIsso ocorre porque usamos o atributo \"form\" em nosso botão. Nela, definimos a qual formulário este botão pertence.\n\nObrigado por ler e espero ter ajudado mais alguém.","status":"published","source_url":null,"created_at":"2022-12-17T20:26:15.960Z","updated_at":"2022-12-18T03:08:52.487Z","published_at":"2022-12-17T20:26:15.984Z","deleted_at":null,"owner_username":"mikeg","tabcoins":10,"children_deep_count":9}]